{"firstName":"George","lastName":"Washington","dob":"1732-02-22","dod":"1799-12-14","presidentNumber":1,"terms":2,"party":"No Party","birthplace":{"city":"Westmoreland County","state":"Virginia","latitude":38.3151,"longitude":-76.7499},"image":"george-washington.jpg","vicePresidents":[{"firstName":"John","lastName":"Adams","dob":"1735-10-30","dod":"1826-07-04","presidentNumber":2,"terms":1,"party":"Federalist"}],"firstLadies":[{"firstName":"Martha","lastName":"Washington","dob":"1731-06-02","dod":"1802-05-22"}],"description":"<p><b>George Washington</b> (February 22, 1732 - <span>December 14</span>, 1799) was an American Founding Father, politician, military officer, and farmer who served as the first president of the United States from 1789 to 1797. Appointed by the Second Continental Congress as commander of the Continental Army in 1775, Washington led Patriot forces to victory in the American Revolutionary War and then served as president of the Constitutional Convention in 1787, which drafted the current Constitution of the United States. Washington has thus become commonly known as the \"Father of his Country\".\n</p><p>Washington's first public office, from 1749 to 1750, was as surveyor of Culpeper County in the Colony of Virginia. In 1752, he received military training and was granted the rank of major in the Virginia Regiment. During the French and Indian War, Washington was promoted to lieutenant colonel in 1754 and subsequently became head of the Virginia Regiment in 1755. He was later elected to the Virginia House of Burgesses and was named a delegate to the Continental Congress in Philadelphia, which appointed him commander-in-chief of the Continental Army. Washington led American forces to a decisive victory over the British in the Revolutionary War, leading the British to sign the Treaty of Paris, which acknowledged the sovereignty and independence of the United States. He resigned his commission in 1783 after the conclusion of the Revolutionary War.\n</p><p>Washington played an indispensable role in adopting and ratifying the Constitution, which replaced the Articles of Confederation in 1789. He was then twice elected president unanimously by the Electoral College in 1788 and 1792. As the first U.S. president, Washington implemented a strong, well-financed national government while remaining impartial in a fierce rivalry that emerged between cabinet members Thomas Jefferson and Alexander Hamilton. During the French Revolution, he proclaimed a policy of neutrality while additionally sanctioning the Jay Treaty. He set enduring precedents for the office of president, including republicanism, a peaceful transfer of power, the use of the title \"Mr. President\", and the two-term tradition. His 1796 farewell address became a preeminent statement on republicanism in which he wrote about the importance of national unity and the dangers that regionalism, partisanship, and foreign influence pose to it.\n</p><p>Washington's image is an icon of American culture. He has been memorialized by monuments, a federal holiday, various media depictions, geographical locations including the national capital, the State of Washington, stamps, and currency. In 1976, Washington was posthumously promoted to the rank of general of the Armies, the highest rank in the U.S. Army. Washington consistently ranks in both popular and scholarly polls as one of the greatest presidents in American history.\n</p>"}
{"firstName":"John","lastName":"Adams","dob":"1735-10-30","dod":"1826-07-04","presidentNumber":2,"terms":1,"party":"Federalist","birthplace":{"city":"Braintree","state":"Massachusetts","latitude":42.2098,"longitude":-71.0022},"image":"john-adams.jpg","vicePresidents":[{"firstName":"Thomas","lastName":"Jefferson","dob":"1743-04-13","dod":"1826-07-04","presidentNumber":3,"terms":2,"party":"Democratic-Republican"}],"firstLadies":[{"firstName":"Abigail","lastName":"Adams","dob":"1744-11-22","dod":"1818-10-28"}],"description":"<p><b>John Adams</b> (October 30, 1735 - July 4, 1826) was an American statesman, attorney, diplomat, writer, and Founding Father who served as the second president of the United States from 1797 to 1801. Before his presidency, he was a leader of the American Revolution that achieved independence from Great Britain. During the latter part of the Revolutionary War and in the early years of the new nation, he served the U.S. government as a senior diplomat in Europe. Adams was the first person to hold the office of vice president of the United States, serving from 1789 to 1797. He was a dedicated diarist and regularly corresponded with important contemporaries, including his wife and adviser Abigail Adams and his friend and political rival Thomas Jefferson.\n</p><p>A lawyer and political activist prior to the Revolution, Adams was devoted to the right to counsel and presumption of innocence. He defied anti-British sentiment and successfully defended British soldiers against murder charges arising from the Boston Massacre. Adams was a Massachusetts delegate to the Continental Congress and became a leader of the revolution. He assisted Jefferson in drafting the Declaration of Independence in 1776 and was its primary advocate in Congress. As a diplomat he helped negotiate a peace treaty with Great Britain and secured vital governmental loans. Adams was the primary author of the Massachusetts Constitution in 1780, which influenced the United States Constitution, as did his essay <i>Thoughts on Government</i>.\n</p><p>Adams was elected to two terms as vice president under President George Washington and was elected as the United States' second president in 1796. He was the only president elected under the banner of the Federalist Party. Adams's term was dominated by the issue of the French Revolutionary Wars, and his insistence on American neutrality led to fierce criticism from both the Jeffersonian Republicans and from some in his own party, led by his rival Alexander Hamilton. Adams signed the controversial Alien and Sedition Acts, and built up the Army and Navy in the undeclared naval war with France. He was the first president to reside in the White House.\n</p><p>In his bid in 1800 for reelection to the presidency, opposition from Federalists and accusations of despotism from Jeffersonians led to Adams losing to his vice president and former friend Jefferson, and he retired to Massachusetts. He eventually resumed his friendship with Jefferson by initiating a continuing correspondence. He and Abigail started the Adams political family, which includes their son John Quincy Adams, the sixth president. John Adams died on July 4, 1826 - the fiftieth anniversary of the adoption of the Declaration of Independence. New Englanders Adams and his son are the only presidents of the first twelve who never owned slaves. Historians and scholars have favorably ranked his administration.\n</p>"}
{"firstName":"Thomas","lastName":"Jefferson","dob":"1743-04-13","dod":"1826-07-04","presidentNumber":3,"terms":2,"party":"Democratic-Republican","birthplace":{"city":"Shadwell","state":"Virginia","latitude":38.0183,"longitude":-78.4256},"image":"thomas-jefferson.jpg","vicePresidents":[{"firstName":"Aaron","lastName":"Burr","dob":"1756-02-06","dod":"1836-09-14","presidentNumber":3,"terms":1,"party":"Democratic-Republican"},{"firstName":"George","lastName":"Clinton","dob":"1739-07-26","dod":"1812-04-20","presidentNumber":4,"terms":1,"party":"Democratic-Republican"}],"firstLadies":[{"firstName":"Martha","lastName":"Jefferson","dob":"1748-10-30","dod":"1782-09-06"}],"description":"<p><b>Thomas Jefferson</b> (April 13, 1743 - July 4, 1826) was an American statesman, planter, diplomat, lawyer, architect, philosopher, and Founding Father who served as the third president of the United States from 1801 to 1809. He was the primary author of the Declaration of Independence. Following the American Revolutionary War and before becoming president in 1801, Jefferson was the nation's first U.S. secretary of state under George Washington and then the nation's second vice president under John Adams. Jefferson was a leading proponent of democracy, republicanism, and individual rights, and produced formative documents and decisions at the state, national, and international levels. \n</p><p>Jefferson was born into the Colony of Virginia's planter class, dependent on slave labor. During the American Revolution, Jefferson represented Virginia at the Second Continental Congress and served as the second governor of revolutionary Virginia from 1779 to 1781. In 1785, Congress appointed Jefferson U.S. minister to France, where he served from 1785 to 1789. President Washington then appointed Jefferson the nation's first secretary of state, where he served from 1790 to 1793. During this time, in the early 1790s, Jefferson and political ally James Madison organized the Democratic-Republican Party to oppose the Federalist Party during the formation of the nation's First Party System. Jefferson and Federalist John Adams became both personal friends and political rivals. In the 1796 U.S. presidential election between the two, Jefferson came in second, which made him Adams' vice president under the electoral laws of the time. Four years later, in the 1800 presidential election, Jefferson again challenged Adams, and won the presidency. In 1804, Jefferson was reelected overwhelmingly to a second term.\n</p><p>As president, Jefferson assertively defended the nation's shipping and trade interests against Barbary pirates and aggressive British trade policies, promoted a western expansionist policy with the Louisiana Purchase, which doubled the nation's geographic size, and was able to reduce military forces and expenditures following successful negotiations with France. In his second presidential term, Jefferson was beset by difficulties at home, including the trial of his former vice president Aaron Burr. In 1807, Jefferson implemented the Embargo Act to defend the nation's industries from British threats to U.S. shipping, limiting foreign trade and stimulating the birth of the American manufacturing industry. Presidential scholars and historians praise Jefferson's public achievements, including his advocacy of religious freedom and tolerance, his peaceful acquisition of the Louisiana Territory from France, and his leadership in supporting the Lewis and Clark Expedition; acknowledging the fact of his lifelong ownership of large numbers of slaves, they give differing interpretations of his views on and relationship with slavery.\n</p><p>Jefferson is ranked by both scholars and in public opinion among the upper tier of American presidents.\n</p>"}
{"firstName":"James","lastName":"Madison","dob":"1751-03-16","dod":"1836-06-28","presidentNumber":4,"terms":2,"party":"Democratic-Republican","birthplace":{"city":"Port Conway","state":"Virginia","latitude":38.1729,"longitude":-77.2197},"image":"james-madison.jpg","vicePresidents":[{"firstName":"George","lastName":"Clinton","dob":"1739-07-26","dod":"1812-04-20","presidentNumber":4,"terms":1,"party":"Democratic-Republican"},{"firstName":"Elbridge","lastName":"Gerry","dob":"1744-07-17","dod":"1814-11-23","presidentNumber":5,"terms":1,"party":"Democratic-Republican"}],"firstLadies":[{"firstName":"Dolley","lastName":"Madison","dob":"1768-05-20","dod":"1849-07-12"}],"description":"<p><b>James Madison</b> (March 16, 1751 - June 28, 1836) was an American statesman, diplomat, and Founding Father who served as the fourth president of the United States from 1809 to 1817. Madison was popularly acclaimed the \"Father of the Constitution\" for his pivotal role in drafting and promoting the Constitution of the United States and the Bill of Rights.\n</p><p>Madison was born into a prominent slave-owning planter family in Virginia. He was a member of the Virginia House of Delegates and the Continental Congress during and after the American Revolutionary War. Dissatisfied with the weak national government established by the Articles of Confederation, he helped organize the Constitutional Convention, which produced a new constitution designed to strengthen republican government against democratic assembly. Madison's Virginia Plan was the basis for the convention's deliberations. He became one of the leaders in the movement to ratify the Constitution and joined Alexander Hamilton and John Jay in writing <i>The Federalist Papers</i>, a series of pro-ratification essays that remains prominent among works of political science in American history. Madison emerged as an important leader in the House of Representatives and was a close adviser to President George Washington. During the early 1790s, Madison opposed the economic program and the accompanying centralization of power favored by Secretary of the Treasury Hamilton. Alongside Thomas Jefferson, he organized the Democratic-Republican Party in opposition to Hamilton's Federalist Party. Madison served as Jefferson's Secretary of State from 1801 to 1809, during which time Jefferson made the Louisiana Purchase. \n</p><p>Madison was elected president in 1808. Motivated by desire to acquire land held by Britain, Spain, and Native Americans, and after diplomatic protests with a trade embargo failed to end British seizures of American shipped goods, Madison led the United States into the War of 1812. Although the war ended inconclusively, many Americans viewed it as a successful \"second war of independence\" against Britain. Madison was re-elected in 1812. The war convinced Madison of the necessity of a stronger federal government. He presided over the creation of the Second Bank of the United States and the enactment of the protective Tariff of 1816. By treaty or through war, Native American tribes ceded 26,000,000 acres (11,000,000 ha) of land to the United States under Madison's presidency.\n</p><p>Retiring from public office at the end of his presidency in 1817, Madison returned to his plantation, Montpelier, and died there in 1836. Madison was a slave owner; he freed one slave in 1783 to prevent a slave rebellion at Montpelier, but did not free any in his will. Among historians, Madison is considered one of the most important Founding Fathers of the United States. Leading historians have generally ranked him as an above-average president, although they are critical of his endorsement of slavery and his leadership during the War of 1812. Madison's name is commemorated in many landmarks across the nation, with prominent examples including Madison Square Garden, James Madison University, the James Madison Memorial Building, and the USS <i>James Madison</i>.\n</p>"}
{"firstName":"James","lastName":"Monroe","dob":"1758-04-28","dod":"1831-07-04","presidentNumber":5,"terms":2,"party":"Democratic-Republican","birthplace":{"city":"Monroe Hall","state":"Virginia","latitude":38.2976,"longitude":-77.1724},"image":"james-monroe.jpg","vicePresidents":[{"firstName":"Daniel","lastName":"Tompkins","dob":"1774-06-21","dod":"1825-06-11","presidentNumber":6,"terms":2,"party":"Democratic-Republican"}],"firstLadies":[{"firstName":"Elizabeth","lastName":"Monroe","dob":"1768-06-30","dod":"1830-09-23"}],"description":"<p><b>James Monroe</b> (April 28, 1758 - July 4, 1831) was an American statesman, lawyer, diplomat, and Founding Father who served as the fifth president of the United States from 1817 to 1825, a member of the Democratic-Republican Party. He was the last Founding Father to serve as president as well as the last president of the Virginia dynasty. His presidency coincided with the Era of Good Feelings, concluding the First Party System era of American politics. He issued the Monroe Doctrine, a policy of limiting European colonialism in the Americas. Monroe previously served as governor of Virginia, a member of the United States Senate, U.S. ambassador to France and Britain, the seventh secretary of state, and the eighth secretary of war.\n</p><p>During the American Revolutionary War, he served in the Continental Army. Monroe studied law under Thomas Jefferson from 1780 to 1783 and subsequently served as a delegate to the Continental Congress as well as a delegate to the Virginia Ratifying Convention. He opposed the ratification of the United States Constitution. In 1790, Monroe won election to the Senate where he became a leader of the Democratic-Republican Party. He left the Senate in 1794 to serve as President George Washington's ambassador to France but was recalled by Washington in 1796. Monroe won the election as Governor of Virginia in 1799 and strongly supported Jefferson's candidacy in the 1800 presidential election.\n</p><p>As President Jefferson's special envoy, Monroe helped negotiate the Louisiana Purchase, through which the United States nearly doubled in size. Monroe fell out with his longtime friend James Madison after Madison rejected the Monroe-Pinkney Treaty that Monroe negotiated with Britain. He unsuccessfully challenged Madison for the Democratic-Republican nomination in the 1808 presidential election, but he joined Madison's administration as Secretary of State in 1811. During the later stages of the War of 1812, Monroe simultaneously served as Madison's Secretary of State and Secretary of War. Monroe's wartime leadership established him as Madison's heir apparent, and he easily defeated Federalist candidate Rufus King in the 1816 presidential election.\n</p><p>During Monroe's tenure as president, the Federalist Party collapsed as a national political force and Monroe was re-elected, virtually unopposed, in 1820. As president, he signed the Missouri Compromise, which admitted Missouri as a slave state and banned slavery from territories north of the 36°30' parallel. In foreign affairs, Monroe and Secretary of State John Quincy Adams favored a policy of conciliation with Britain and a policy of expansionism against the Spanish Empire. In the 1819 Adams-Onis Treaty with Spain, the United States secured Florida and established its western border with New Spain. In 1823, Monroe announced the United States' opposition to any European intervention in the recently independent countries of the Americas with the Monroe Doctrine, which became a landmark in American foreign policy. Monroe was a member of the American Colonization Society which supported the colonization of Africa by freed slaves, and Liberia's capital of Monrovia is named in his honor.\n</p><p>Following his retirement in 1825, Monroe was plagued by financial difficulties and died on July 4, 1831, in New York City -- sharing a distinction with Presidents John Adams and Thomas Jefferson of dying on the anniversary of U.S. independence. Historians have generally ranked him as an above-average president.\n</p>"}
{"firstName":"John Quincy","lastName":"Adams","dob":"1767-07-11","dod":"1848-02-23","presidentNumber":6,"terms":1,"party":"Democratic-Republican","birthplace":{"city":"Braintree","state":"Massachusetts","latitude":42.2098,"longitude":-71.0022},"image":"john-quincy-adams.jpg","vicePresidents":[{"firstName":"John C.","lastName":"Calhoun","dob":"1782-03-18","dod":"1850-03-31","presidentNumber":7,"terms":1,"party":"Democratic-Republican"}],"firstLadies":[{"firstName":"Louisa","lastName":"Adams","dob":"1775-02-12","dod":"1852-05-15"}],"description":"<p><b>John Quincy Adams</b> (<span> </span>; July 11, 1767 - February 23, 1848) was an American statesman, politician, diplomat, lawyer, and diarist who served as the sixth president of the United States, from 1825 to 1829. He previously served as the eighth United States secretary of state from 1817 to 1825. During his long diplomatic and political career, Adams served as an ambassador and also as a member of the United States Congress representing Massachusetts in both chambers. He was the eldest son of John Adams, who served as the second president of the United States from 1797 to 1801, and First Lady Abigail Adams. Initially a Federalist like his father, he won election to the presidency as a member of the Democratic-Republican Party, and later, in the mid-1830s, became affiliated with the Whig Party.\n</p><p>Born in Braintree, Massachusetts, Adams spent much of his youth in Europe, where his father served as a diplomat. After returning to the United States, Adams established a successful legal practice in Boston. In 1794, President George Washington appointed Adams as the U.S. ambassador to the Netherlands, and Adams would serve in high-ranking diplomatic posts until 1801, when Thomas Jefferson took office as president. Federalist leaders in Massachusetts arranged for Adams's election to the United States Senate in 1802, but Adams broke with the Federalist Party over foreign policy and was denied re-election. In 1809, President James Madison, a member of the Democratic-Republican Party, appointed Adams as the U.S. ambassador to Russia. Multilingual, Adams held diplomatic posts for the duration of Madison's presidency, and he served as part of the American delegation that negotiated an end to the War of 1812. In 1817, President James Monroe selected Adams as his secretary of state. In that role, Adams negotiated the Adams-Onis Treaty, which provided for the American acquisition of Florida. He also helped formulate the Monroe Doctrine, which became a key tenet of U.S. foreign policy. In 1818, Adams was elected a member of the American Philosophical Society in Philadelphia.\n</p><p>Adams, Andrew Jackson, William H. Crawford, and Henry Clay -- all members of the Democratic-Republican Party -- competed in the 1824 presidential election. Because no candidate won a majority of electoral votes, the House of Representatives held a contingent election, which Adams won with the support of Speaker of the House Henry Clay, whom Adams would controversially appoint as his secretary of state. As president, Adams called for an ambitious agenda that included federally funded infrastructure projects, the establishment of a national university, and engagement with the countries of Latin America, but Congress refused to pass many of his initiatives. During Adams's presidency, the Democratic-Republican Party split into two major camps: the National Republican Party, which supported Adams, and Andrew Jackson's Democratic Party. The Democrats proved to be more effective political organizers than Adams and his National Republican supporters, and Jackson soundly defeated Adams in the 1828 presidential election, making Adams the second president to fail to win re-election (his father being the first).\n</p><p>Rather than retiring from public service, Adams won election to the House of Representatives, where he would serve from 1831 until his death in 1848. He remains the only former president to be elected to the chamber. After narrowly losing his bids for Governor of Massachusetts and Senate re-election, Adams joined the Anti-Masonic Party in the early 1830s before joining the Whig Party, which united those opposed to President Jackson. During his time in Congress, Adams became increasingly critical of slavery and of the Southern leaders whom he believed controlled the Democratic Party. He was particularly opposed to the annexation of Texas and the Mexican-American War, which he saw as a war to extend slavery and its political grip on Congress. He also led the repeal of the \"gag rule\", which had prevented the House of Representatives from debating petitions to abolish slavery. Historians concur that Adams was one of the greatest diplomats and secretaries of state in American history; they typically rank him as an average president, as he had an ambitious agenda but could not get it passed by Congress. By contrast, historians also view Adams in a more positive light during his post-presidency because of his vehement stance against slavery, as well as his fight for the rights of women and Native Americans.\n</p>"}
{"firstName":"Andrew","lastName":"Jackson","dob":"1767-03-15","dod":"1845-06-08","presidentNumber":7,"terms":2,"party":"Democratic","birthplace":{"city":"Waxhaws Region","state":"South/North Carolina","latitude":34.9246,"longitude":-80.7434},"image":"andrew-jackson.jpg","vicePresidents":[{"firstName":"John C.","lastName":"Calhoun","dob":"1782-03-18","dod":"1850-03-31","presidentNumber":7,"terms":1,"party":"Democratic"},{"firstName":"Martin","lastName":"Van Buren","dob":"1782-12-05","dod":"1862-07-24","presidentNumber":8,"terms":1,"party":"Democratic"}],"firstLadies":[{"firstName":"Rachel","lastName":"Jackson","dob":"1767-06-15","dod":"1828-12-22"}],"description":"<p><b>Andrew Jackson</b>  (March 15, 1767 - June 8, 1845) was an American lawyer, planter, general, and statesman who served as the seventh president of the United States from 1829 to 1837. Before his presidency, he gained fame as a general in the U.S. Army and served in both houses of the U.S. Congress. Often praised as an advocate for ordinary Americans and for his work in preserving the union of states, Jackson has also been criticized for his racial policies, particularly his treatment of Native Americans.\n</p><p>Jackson was born in the colonial Carolinas before the American Revolutionary War. He became a frontier lawyer and married Rachel Donelson Robards. He briefly served in the U.S. House of Representatives and the U.S. Senate, representing Tennessee. After resigning, he served as a justice on the Tennessee Superior Court from 1798 until 1804. Jackson purchased a property later known as the Hermitage, becoming a wealthy planter who owned hundreds of African-American slaves during his lifetime. In 1801, he was appointed colonel of the Tennessee militia and was elected its commander. He led troops during the Creek War of 1813-1814, winning the Battle of Horseshoe Bend and negotiating the Treaty of Fort Jackson that required the indigenous Creek population to surrender vast tracts of present-day Alabama and Georgia. In the concurrent war against the British, Jackson's victory at the Battle of New Orleans in 1815 made him a national hero. He later commanded U.S. forces in the First Seminole War, which led to the annexation of Florida from Spain. Jackson briefly served as Florida's first territorial governor before returning to the Senate. He ran for president in 1824. He won a plurality of the popular and electoral vote, but no candidate won the electoral majority. With the help of Henry Clay, the House of Representatives elected John Quincy Adams in a contingent election. Jackson's supporters alleged that there was a \"corrupt bargain\" between Adams and Clay and began creating their own political organization that would eventually become the Democratic Party.\n</p><p>Jackson ran again in 1828, defeating Adams in a landslide. In 1830, he signed the Indian Removal Act. This act, which has been described as ethnic cleansing, displaced tens of thousands of Native Americans from their ancestral homelands east of the Mississippi and resulted in thousands of deaths. Jackson faced a challenge to the integrity of the federal union when South Carolina threatened to nullify a high protective tariff set by the federal government. He threatened the use of military force to enforce the tariff, but the crisis was defused when it was amended. In 1832, he vetoed a bill by Congress to reauthorize the Second Bank of the United States, arguing that it was a corrupt institution. After a lengthy struggle, the Bank was dismantled. In 1835, Jackson became the only president to pay off the national debt. He survived the first assassination attempt on a sitting president. In one of his final presidential acts, he recognized the Republic of Texas.\n</p><p>After leaving office, Jackson supported the presidencies of Martin Van Buren and James K. Polk, as well as the annexation of Texas. Jackson's legacy remains controversial, and opinions on his legacy are frequently polarized. Supporters characterize him as a defender of democracy and the Constitution, while critics point to his reputation as a demagogue who ignored the law when it suited him. Scholarly rankings of presidents historically rated Jackson's presidency as above average. Since the late 20th century, his reputation declined, and in the 21st century his placement in rankings of presidents fell.\n</p>"}
{"firstName":"Martin","lastName":"Van Buren","dob":"1782-12-05","dod":"1862-07-24","presidentNumber":8,"terms":1,"party":"Democratic","birthplace":{"city":"Kinderhook","state":"New York","latitude":42.3957,"longitude":-73.6975},"image":"martin-van-buren.jpg","vicePresidents":[{"firstName":"Richard","lastName":"Mentor Johnson","dob":"1780-10-17","dod":"1850-11-19","presidentNumber":9,"terms":1,"party":"Democratic"}],"firstLadies":[{"firstName":"Hannah","lastName":"Van Buren","dob":"1783-03-08","dod":"1819-02-05"}],"description":"<p><b>Martin Van Buren</b> (December 5, 1782 - July 24, 1862) was an American lawyer, diplomat, and statesman who served as the eighth president of the United States from 1837 to 1841. A primary founder of the Democratic Party, he served as New York's attorney general and U.S. senator, then briefly as the ninth governor of New York before joining Andrew Jackson's administration as the tenth United States secretary of state, minister to Great Britain, and ultimately the eighth vice president from 1833 to 1837, after being elected on Jackson's ticket in 1832. Van Buren won the presidency in 1836 against divided Whig opponents. Van Buren lost re-election in 1840, and failed to win the Democratic nomination in 1844. Later in his life, Van Buren emerged as an elder statesman and an anti-slavery leader who led the Free Soil Party ticket in the 1848 presidential election.\n</p><p>Van Buren was born in Kinderhook, New York, where most residents were of Dutch descent and spoke Dutch as their primary language; he is the only president to have spoken English as a second language. Trained as a lawyer, he entered politics as a member of the Democratic-Republican Party, won a seat in the New York State Senate, and was elected to the United States Senate in 1821. As the leader of the Bucktails faction of the party, Van Buren established the political machine known as the Albany Regency. He ran successfully for governor of New York to support Andrew Jackson's candidacy in the 1828 presidential election but resigned shortly after Jackson was inaugurated so he could accept appointment as Jackson's secretary of state. In the cabinet, Van Buren was a key Jackson advisor and built the organizational structure for the coalescing Democratic Party. He ultimately resigned to help resolve the Petticoat affair and briefly served as ambassador to Great Britain. At Jackson's behest, the 1832 Democratic National Convention nominated Van Buren for vice president, and he took office after the Democratic ticket won the 1832 presidential election.\n</p><p>With Jackson's strong support and the organizational strength of the Democratic Party, Van Buren successfully ran for president in the 1836 presidential election. However, his popularity soon eroded because of his response to the Panic of 1837, which centered on his Independent Treasury system, a plan under which the federal government of the United States would store its funds in vaults rather than in banks; more conservative Democrats and Whigs in Congress ultimately delayed his plan from being implemented until 1840. His presidency was further marred by the costly Second Seminole War and his refusal to admit Texas to the Union as a slave state. In 1840, Van Buren lost his re-election bid to William Henry Harrison. While Van Buren is praised for anti-slavery stances, in historical rankings, historians and political scientists often rank Van Buren as an average or below-average U.S. president, due to his handling of the Panic of 1837.\n</p><p>Van Buren was initially the leading candidate for the Democratic Party's nomination again in 1844, but his continued opposition to the annexation of Texas angered Southern Democrats, leading to the nomination of James K. Polk. Growing opposed to slavery, Van Buren was the newly formed Free Soil Party's presidential nominee in 1848, and his candidacy helped Whig nominee Zachary Taylor defeat Democrat Lewis Cass. Worried about sectional tensions, Van Buren returned to the Democratic Party after 1848 but was disappointed with the pro-southern presidencies of Franklin Pierce and James Buchanan. During the American Civil War, Van Buren was a War Democrat who supported the policies of President Abraham Lincoln, a Republican. He died of asthma at his home in Kinderhook in 1862, aged 79.\n</p>"}
{"firstName":"William Henry","lastName":"Harrison","dob":"1773-02-09","dod":"1841-04-04","presidentNumber":9,"terms":1,"party":"Whig","birthplace":{"city":"Charles City County","state":"Virginia","latitude":37.3439,"longitude":-77.0713},"image":"william-henry-harrison.jpg","vicePresidents":[{"firstName":"John","lastName":"Tyler","dob":"1790-03-29","dod":"1862-01-18","presidentNumber":10,"terms":1,"party":"Whig"}],"firstLadies":[{"firstName":"Anna","lastName":"Harrison","dob":"1775-07-25","dod":"1864-02-25"}],"description":"<p><b>William Henry Harrison</b> (February 9, 1773 - April 4, 1841) was an American military officer and politician who served as the ninth president of the United States from March 4 to April 4, 1841, the shortest presidency in U.S. history. He was also the first U.S. president to die in office, causing a brief constitutional crisis since presidential succession was not then fully defined in the U.S. Constitution. Harrison was the last president born as a British subject in the Thirteen Colonies and was the grandfather of Benjamin Harrison, the 23rd U.S. president.\n</p><p>Harrison was born into the Harrison family of Virginia in 1773 as a son of Benjamin Harrison V, a U.S. Founding Father. In 1794, Harrison participated in the Battle of Fallen Timbers, an American military victory that ended the Northwest Indian War. In 1811, he led a military force against Tecumseh's confederacy at the Battle of Tippecanoe, where he earned the nickname \"<b>Old Tippecanoe</b>\". He was promoted to major general in the Army during the War of 1812, and led American infantry and cavalry to victory at the Battle of the Thames in Upper Canada.\n</p><p>Harrison's political career began in 1798, with an appointment as secretary of the Northwest Territory. In 1799, he was elected as the territory's non-voting delegate in the U.S. House of Representatives. He became governor of the newly established Indiana Territory in 1801 and negotiated multiple treaties with American Indian tribes, with the nation acquiring millions of acres. After the War of 1812, he moved to Ohio where, in 1816, he was elected to represent the state's 1st district in the House. In 1824, he was elected to the U.S. Senate, though his Senate term was cut short by his appointment as minister plenipotentiary to Gran Colombia in 1828.\n</p><p>Harrison returned to private life in Ohio until he was nominated as one of several Whig Party nominees in the 1836 U.S. presidential election, in which he lost to Democratic vice president Martin Van Buren. In the 1840 presidential election, the party nominated him again, with John Tyler as his running mate, under the campaign slogan \"Tippecanoe and Tyler Too\", and Harrison defeated Van Buren. Just three weeks after his inauguration, Harrison fell ill and died days later. After resolution of an ambiguity in the constitution regarding succession to the powers and duties of the office, Tyler became president. Harrison is remembered for his Indian treaties, and also his inventive election campaign tactics. He is often omitted in historical presidential rankings because of his brief tenure.\n</p>"}
{"firstName":"John","lastName":"Tyler","dob":"1790-03-29","dod":"1862-01-18","presidentNumber":10,"terms":1,"party":"Whig","birthplace":{"city":"Charles City County","state":"Virginia","latitude":37.3439,"longitude":-77.0713},"image":"john-tyler.png","vicePresidents":[],"firstLadies":[{"firstName":"Letitia","lastName":"Tyler","dob":"1790-11-12","dod":"1842-09-10"},{"firstName":"Julia","lastName":"Tyler","dob":"1820-05-04","dod":"1889-07-10"}],"description":"<p><b>John Tyler</b> (March 29, 1790 - January 18, 1862) was the 10th president of the United States, serving from 1841 to 1845, after briefly holding office as the tenth vice president in 1841. He was elected vice president on the 1840 Whig ticket with President William Henry Harrison, succeeding to the presidency following Harrison's death 31 days after assuming office. Tyler was a stalwart supporter and advocate of states' rights, including regarding slavery, and he adopted nationalistic policies as president only when they did not infringe on the states' powers. His unexpected rise to the presidency posed a threat to the presidential ambitions of Henry Clay and other Whig politicians and left Tyler estranged from both of the nation's major political parties at the time.\n</p><p>Tyler was born into a prominent slaveholding Virginia family. He became a national figure at a time of political upheaval. In the 1820s, the Democratic-Republican Party, at the time the nation's only political party, split into several factions. Initially a Jacksonian Democrat, Tyler opposed President Andrew Jackson during the nullification crisis as he saw Jackson's actions as infringing on states' rights and criticized Jackson's expansion of executive power during  Jackson's veto on banks. This led Tyler to ally with the southern faction of the Whig Party. He served as a Virginia state legislator and governor, U.S. representative, and U.S. senator. Tyler was a regional Whig vice-presidential nominee in the 1836 presidential election; they lost. He was the sole nominee on the 1840 Whig presidential ticket as William Henry Harrison's running mate. Under the campaign slogan \"Tippecanoe and Tyler Too\", the Harrison-Tyler ticket defeated incumbent president Martin Van Buren.\n</p><p>President Harrison died just one month after taking office, and Tyler became the first vice president to succeed to the presidency. Amid uncertainty as to whether a vice president succeeded a deceased president, or merely took on his duties, Tyler immediately took the presidential oath of office, setting a lasting precedent. He signed into law some of the Whig-controlled Congress's bills, but he was a strict constructionist and vetoed the party's bills to create a national bank and raise tariff rates. He believed that the president, rather than Congress, should set policy, and he sought to bypass the Whig establishment led by Senator Henry Clay. Almost all of Tyler's cabinet resigned shortly into his term and the Whigs expelled him from the party and dubbed him \"His Accidency\". Tyler was the first president to have his veto of legislation overridden by Congress. He faced a stalemate on domestic policy, although he had several foreign-policy achievements, including the Webster-Ashburton Treaty with Britain and the Treaty of Wanghia with China. Tyler was a believer in manifest destiny and saw the annexation of Texas as economically and internationally advantageous to the United States, signing a bill to offer Texas statehood just before leaving office.\n</p><p>When the American Civil War began in 1861, Tyler at first supported the Peace Conference. When it failed, he sided with the Confederacy. He presided over the opening of the Virginia Secession Convention and served as a member of the Provisional Congress of the Confederate States. Tyler subsequently won election to the Confederate House of Representatives but died before it assembled.  Some scholars have praised Tyler's political influence, but historians have generally put Tyler near the bottom quartile when ranking U.S. presidents. Tyler is praised for helping in the creation of the Webster-Ashburton treaty, which peacefully settled the border between Maine and Canada. He also helped in stopping African slave trafficking, which was made illegal under the Jefferson administration. Today, Tyler is seldom remembered when in comparison to other presidents and maintains only a limited presence in American cultural memory.\n</p>"}
{"firstName":"James K.","lastName":"Polk","dob":"1795-11-02","dod":"1849-06-15","presidentNumber":11,"terms":1,"party":"Democratic","birthplace":{"city":"Pineville","state":"North Carolina","latitude":35.0832,"longitude":-80.8923},"image":"james-polk.jpg","vicePresidents":[{"firstName":"George","lastName":"Dallas","dob":"1792-07-10","dod":"1864-12-31","presidentNumber":11,"terms":1,"party":"Democratic"}],"firstLadies":[{"firstName":"Sarah","lastName":"Polk","dob":"1803-09-04","dod":"1891-08-14"}],"description":"<p><b>James Knox Polk</b> (<span></span>; November 2, 1795 - June 15, 1849) was the 11th president of the United States, serving from 1845 to 1849. He also served as the 13th speaker of the House of Representatives from 1835 to 1839 and the ninth governor of Tennessee from 1839 to 1841. A protege of Andrew Jackson, he was a member of the Democratic Party and an advocate of Jacksonian democracy. Polk is known for extending the territory of the United States through the Mexican-American War during his presidency, annexing the Republic of Texas, the Oregon Territory, and the Mexican Cession after winning the Mexican-American War.\n</p><p>After building a successful law practice in Tennessee, Polk was elected to its state legislature in 1823 and then to the United States House of Representatives in 1825, becoming a strong supporter of Jackson. After serving as chairman of the Ways and Means Committee, he became Speaker of the House in 1835, the only person to serve both as Speaker and U.S. president. Polk left Congress to run for governor of Tennessee, winning in 1839 but losing in 1841 and 1843. He was a dark-horse candidate in the 1844 presidential election as the Democratic Party nominee; he entered his party's convention as a potential nominee for vice president but emerged as a compromise to head the ticket when no presidential candidate could gain the necessary two-thirds majority. In the general election, Polk defeated Henry Clay of the Whig Party.\n</p><p>After a negotiation fraught with the risk of war, Polk reached a settlement with Great Britain over the disputed Oregon Country, with the territory for the most part divided along the 49th parallel. He oversaw victory in the Mexican-American War, resulting in Mexico's cession of the entire American Southwest. He secured a substantial reduction of tariff rates with the Walker tariff of 1846. The same year, he achieved his other major goal, reestablishment of the Independent Treasury system. True to his campaign pledge to serve only one term (one of the few U.S. presidents to make and keep such a pledge), Polk left office in 1849 and returned to Tennessee, where he died of cholera soon afterward.\n</p><p>Though he is relatively obscure today, scholars have ranked Polk favorably for his ability to promote and achieve the major items on his presidential agenda. He has also been criticized for leading the country into a war with Mexico that exacerbated sectional divides. A property owner who used slave labor, he kept a plantation in Mississippi and increased his slave ownership during his presidency. Polk's policy of territorial expansion saw the nation reach the Pacific coast and almost all its contiguous borders. He helped make the U.S. a nation poised to become a world power, but with divisions between free and slave states gravely exacerbated, setting the stage for the Civil War.\n</p>"}
{"firstName":"Zachary","lastName":"Taylor","dob":"1784-11-24","dod":"1850-07-09","presidentNumber":12,"terms":1,"party":"Whig","birthplace":{"city":"Barboursville","state":"Virginia","latitude":38.1714,"longitude":-78.2771},"image":"zachary-taylor.jpg","vicePresidents":[{"firstName":"Millard","lastName":"Fillmore","dob":"1800-01-07","dod":"1874-03-08","presidentNumber":13,"terms":1,"party":"Whig"}],"firstLadies":[{"firstName":"Margaret","lastName":"Taylor","dob":"1788-09-21","dod":"1852-08-18"}],"description":"<p><b>Zachary Taylor</b> (November 24, 1784 - July 9, 1850) was the 12th president of the United States, serving from 1849 until his death in 1850. Taylor was a career officer in the United States Army, rising to the rank of major general and becoming a national hero for his victories in the Mexican-American War. As a result, he won election to the White House despite his vague political beliefs. His top priority as president was to preserve the Union. He died 16 months into his term from a stomach disease. Taylor had the third-shortest presidential term in U.S. history.\n</p><p>Taylor was born into a prominent family of plantation owners who moved westward from Virginia to Louisville, Kentucky, in his youth. He was the last president born before the adoption of the Constitution. He was commissioned as an officer in the U.S. Army in 1808 and made a name for himself as a captain in the War of 1812. He climbed the ranks of the military, establishing military forts along the Mississippi River and entering the Black Hawk War as a colonel in 1832. His success in the Second Seminole War attracted national attention and earned him the nickname \"Old Rough and Ready\".\n</p><p>In 1845, during the annexation of Texas, President James K. Polk dispatched Taylor to the Rio Grande in anticipation of a battle with Mexico over the disputed Texas-Mexico border. The Mexican-American War broke out in April 1846, and Taylor defeated Mexican troops commanded by General Mariano Arista at the battles of Palo Alto and Resaca de la Palma, driving Arista's troops out of Texas. Taylor then led his troops into Mexico, where they defeated Mexican troops commanded by Pedro de Ampudia at the Battle of Monterrey. Defying orders, Taylor led his troops further south and, despite being severely outnumbered, dealt a crushing blow to Mexican forces under General Antonio Lopez de Santa Anna at the Battle of Buena Vista. Taylor's troops were transferred to the command of Major General Winfield Scott, but Taylor retained his popularity.\n</p><p>The Whig Party convinced a reluctant Taylor to lead its ticket in the 1848 presidential election, despite his unclear political tenets and lack of interest in politics. At the 1848 Whig National Convention, Taylor defeated Winfield Scott and former senator Henry Clay for the party's nomination. He won the general election alongside New York politician Millard Fillmore, defeating Democratic Party nominees Lewis Cass and William Orlando Butler, as well as a third-party effort led by former president Martin Van Buren and Charles Francis Adams Sr. of the Free Soil Party. Taylor became the first president to be elected without having previously held political office. As president, he kept his distance from Congress and his Cabinet, even though partisan tensions threatened to divide the Union. Debate over the status of slavery in the Mexican Cession dominated the national political agenda and led to threats of secession from Southerners. Despite being a Southerner and a slaveholder himself, Taylor did not push for the expansion of slavery, and sought sectional harmony above all other concerns. To avoid the issue of slavery, he urged settlers in New Mexico and California to bypass the territorial stage and draft constitutions for statehood, setting the stage for the Compromise of 1850.\n</p><p>Taylor died suddenly of a stomach disease on July 9, 1850, with his administration having accomplished little aside from the ratification of the Clayton-Bulwer Treaty and having made no progress on the most divisive issue in Congress and the nation: slavery. Vice President Fillmore assumed the presidency and served the remainder of his term. Historians and scholars have ranked Taylor in the bottom quartile of U.S. presidents, owing in part to his short term of office (16 months), though he has been described as \"more a forgettable president than a failed one\".\n</p>"}
{"firstName":"Millard","lastName":"Fillmore","dob":"1800-01-07","dod":"1874-03-08","presidentNumber":13,"terms":1,"party":"Whig","birthplace":{"city":"Summerhill","state":"New York","latitude":42.6759,"longitude":-76.1794},"image":"millard-filmore.jpg","vicePresidents":[],"firstLadies":[{"firstName":"Abigail","lastName":"Fillmore","dob":"1798-03-13","dod":"1853-03-30"}],"description":"<p><b>Millard Fillmore</b> (January 7, 1800 - March 8, 1874) was the 13th president of the United States, serving from 1850 to 1853, and was the last president to have been a member of the Whig Party while in office. A former member of the U.S. House of Representatives, Fillmore was elected the 12th vice president in 1848, and succeeded to the presidency when Zachary Taylor died in July 1850. Fillmore was instrumental in passing the Compromise of 1850, which led to a brief truce in the battle over the expansion of slavery.\n</p><p>Fillmore was born into poverty in the Finger Lakes area of upstate New York. Though he had little formal schooling, he studied to become a lawyer. He became prominent in the Buffalo area as an attorney and politician, and was elected to the New York Assembly in 1828 and the House of Representatives in 1832. Fillmore initially belonged to the Anti-Masonic Party, but became a member of the Whig Party as it formed in the mid-1830s. He was a rival for the state party leadership with Thurlow Weed and his protege William H. Seward. Throughout his career, Fillmore declared slavery evil but said it was beyond the federal government's power to end it; Seward argued that the federal government had a role to play. Fillmore was an unsuccessful candidate for Speaker of the U.S. House of Representatives when the Whigs took control of the chamber in 1841, but was made chairman of the Ways and Means Committee. Defeated in bids for the Whig nomination for vice president and for New York governor in 1844, Fillmore was elected Comptroller of New York in 1847, the first to hold that post by direct election.\n</p><p>As vice president, Fillmore was largely ignored by Taylor; even in dispensing patronage in New York, Taylor consulted Weed and Seward. But in his capacity as president of the Senate, Fillmore presided over its angry debates, as the 31st Congress decided whether to allow slavery in the Mexican Cession. Unlike Taylor, Fillmore supported Henry Clay's omnibus bill, the basis of the 1850 Compromise. Upon becoming president in July 1850, he dismissed Taylor's cabinet and pushed Congress to pass the compromise. The Fugitive Slave Act, expediting the return of escaped slaves to those who claimed ownership, was a controversial part of the compromise. Fillmore felt duty-bound to enforce it, though it damaged his popularity and also the Whig Party, which was torn between its Northern and Southern factions. In foreign policy, he supported U.S. Navy expeditions to open trade in Japan, opposed French designs on Hawaii, and was embarrassed by Narciso Lopez's filibuster expeditions to Cuba. Fillmore failed to win the Whig nomination for president in 1852.\n</p><p>As the Whig Party broke up after Fillmore's presidency, he and many in its conservative wing joined the Know Nothings and formed the American Party. Despite his party's emphasis on anti-immigration and anti-Catholic policies, during the 1856 presidential election he said little about immigration, focusing on the preservation of the Union, and won only Maryland. During the American Civil War, Fillmore denounced secession and agreed that the Union must be maintained by force if necessary, but was critical of Abraham Lincoln's war policies. After peace was restored, he supported President Andrew Johnson's Reconstruction policies. Fillmore remained involved in civic interests after his presidency, including as chancellor of the University of Buffalo, which he had helped found in 1846. Historians usually rank Fillmore among the worst presidents in American history, largely for his policies regarding slavery, as well as among the least memorable. His association with the Know Nothings and support of Johnson's reconstruction policies further tarnished his reputation.\n</p>"}
{"firstName":"Franklin","lastName":"Pierce","dob":"1804-11-23","dod":"1869-10-08","presidentNumber":14,"terms":1,"party":"Democratic","birthplace":{"city":"Hillsborough","state":"New Hampshire","latitude":43.1132,"longitude":-71.8993},"image":"franklin-pierce.jpg","vicePresidents":[{"firstName":"William","lastName":"King","dob":"1786-04-07","dod":"1853-04-18","presidentNumber":13,"terms":1,"party":"Democratic"}],"firstLadies":[{"firstName":"Jane","lastName":"Pierce","dob":"1806-03-12","dod":"1863-12-02"}],"description":"<p><b>Franklin Pierce</b> (November 23, 1804 - October 8, 1869) was the 14th president of the United States, serving from 1853 to 1857. A northern Democrat who believed that the abolitionist movement was a fundamental threat to the nation's unity, he alienated anti-slavery groups by signing the Kansas-Nebraska Act and enforcing the Fugitive Slave Act. Conflict between North and South continued after Pierce's presidency, and, after Abraham Lincoln was elected president in 1860, the Southern states seceded, resulting in the American Civil War.\n</p><p>Pierce was born in New Hampshire, the son of state governor Benjamin Pierce. He served in the House of Representatives from 1833 until his election to the Senate, where he served from 1837 until his resignation in 1842. His private law practice was a success, and he was appointed New Hampshire's U.S. Attorney in 1845. Pierce took part in the Mexican-American War as a brigadier general in the United States Army. Democrats saw him as a compromise candidate uniting Northern and Southern interests, and nominated him for president on the 49th ballot at the 1852 Democratic National Convention. He and running mate William R. King easily defeated the Whig Party ticket of Winfield Scott and William A. Graham in the 1852 presidential election.\n</p><p>As president, Pierce attempted to enforce neutral standards for civil service while also satisfying the Democratic Party's diverse elements with patronage, an effort that largely failed and turned many in his party against him. He was a Young America expansionist who signed the Gadsden Purchase of land from Mexico and led a failed attempt to acquire Cuba from Spain. He signed trade treaties with Britain and Japan and his Cabinet reformed its departments and improved accountability, but political strife during his presidency overshadowed these successes. His popularity declined sharply in the Northern states after he supported the Kansas-Nebraska Act, which nullified the Missouri Compromise, while many Southern whites continued to support him. The act's passage led to violent conflict over the expansion of slavery in the American West. Pierce's administration was further damaged when several of his diplomats issued the Ostend Manifesto calling for the annexation of Cuba, a document that was roundly criticized. He fully expected the Democrats to renominate him in the 1856 presidential election, but they abandoned him and his bid failed. His reputation in the North suffered further during the American Civil War as he became a vocal critic of President Lincoln.\n</p><p>Pierce was popular and outgoing, but his family life was difficult; his three children died young and his wife, Jane Pierce, suffered from illness and depression for much of her life. Their last surviving son was killed in a train accident while the family was traveling, shortly before Pierce's inauguration. A heavy drinker for much of his life, Pierce died in 1869 of cirrhosis. As a result of his support of the South, as well as failing to hold the Union together in time of strife, historians and scholars generally rank Pierce as one of the worst and least memorable U.S. presidents.\n</p>"}
{"firstName":"James","lastName":"Buchanan","dob":"1791-04-23","dod":"1868-06-01","presidentNumber":15,"terms":1,"party":"Democratic","birthplace":{"city":"Cove Gap","state":"Pennsylvania","latitude":39.8628,"longitude":-77.7797},"image":"james-buchanan.jpg","vicePresidents":[{"firstName":"John","lastName":"Breckinridge","dob":"1821-01-16","dod":"1875-05-17","presidentNumber":14,"terms":1,"party":"Democratic"}],"firstLadies":[],"description":"<p><b>James Buchanan Jr.</b> (April 23, 1791 - June 1, 1868) was an American lawyer, diplomat, and politician who served as the 15th president of the United States from 1857 to 1861. Buchanan also served as the secretary of state from 1845 to 1849 and represented Pennsylvania in both houses of the U.S. Congress. He was an advocate for states' rights, particularly regarding slavery, and minimized the role of the federal government preceding the Civil War.\n</p><p>Buchanan was a lawyer in Pennsylvania and won his first election to the state's House of Representatives as a Federalist. He was elected to the U.S. House of Representatives in 1820 and retained that post for five terms, aligning with Andrew Jackson's Democratic Party. Buchanan served as Jackson's minister to Russia in 1832. He won the election in 1834 as a U.S. senator from Pennsylvania and continued in that position for 11 years. He was appointed to serve as President James K. Polk's secretary of state in 1845, and eight years later was named as President Franklin Pierce's minister to the United Kingdom.\n</p><p>Beginning in 1844, Buchanan became a regular contender for the Democratic Party's presidential nomination. He was nominated and won the 1856 presidential election. As President, Buchanan intervened to assure the Supreme Court's majority ruling in the pro-slavery decision in the <i>Dred Scott</i> case. He acceded to Southern attempts to engineer Kansas' entry into the Union as a slave state under the Lecompton Constitution, and angered not only Republicans but also Northern Democrats. Buchanan honored his pledge to serve only one term and supported Breckinridge's unsuccessful candidacy in the 1860 presidential election. He failed to reconcile the fractured Democratic Party amid the grudge against Stephen Douglas, leading to the election of Republican and former Congressman Abraham Lincoln.\n</p><p>Buchanan's leadership during his lame duck period, before the American Civil War, has been widely criticized. He simultaneously angered the North by not stopping secession and the South by not yielding to their demands. He supported the Corwin Amendment in an effort to reconcile the country. He made an unsuccessful attempt to reinforce Fort Sumter, but otherwise refrained from preparing the military. In his personal life, Buchanan never married and was the only U.S. president to remain a lifelong bachelor, leading some historians and authors to question his sexual orientation. His failure to forestall the Civil War has been described as incompetence, and he spent his last years defending his reputation. Historians and scholars rank Buchanan as among the worst presidents in American history.\n</p>"}
{"firstName":"Abraham","lastName":"Lincoln","dob":"1809-02-12","dod":"1865-04-15","presidentNumber":16,"terms":2,"party":"Republican","birthplace":{"city":"Hodgenville","state":"Kentucky","latitude":37.5739,"longitude":-85.7399},"image":"abraham-lincoln.jpg","vicePresidents":[{"firstName":"Hannibal","lastName":"Hamlin","dob":"1809-08-27","dod":"1891-07-04","presidentNumber":15,"terms":1,"party":"Republican"},{"firstName":"Andrew","lastName":"Johnson","dob":"1808-12-29","dod":"1875-07-31","presidentNumber":16,"terms":1,"party":"National Union"}],"firstLadies":[{"firstName":"Mary","lastName":"Lincoln","dob":"1818-12-13","dod":"1882-07-16"}],"description":"<p><b>Abraham Lincoln</b> (February 12, 1809 - April 15, 1865) was an American lawyer, politician, and statesman who served as the 16th president of the United States from 1861 until his assassination in 1865. He led the United States through the American Civil War, defending the nation as a constitutional union, defeating the insurgent Confederacy, playing a major role in the abolition of slavery, expanding the power of the federal government, and modernizing the U.S. economy.\n</p><p>Lincoln was born into poverty in a log cabin in Kentucky and was raised on the frontier, mainly in Indiana. He was self-educated and became a lawyer, Whig Party leader, Illinois state legislator, and U.S. representative from Illinois. In 1849, he returned to his successful law practice in Springfield, Illinois. In 1854, angered by the Kansas-Nebraska Act, which opened the territories to slavery, he re-entered politics. He soon became a leader of the new Republican Party. He reached a national audience in the 1858 Senate campaign debates against Stephen A. Douglas. Lincoln ran for president in 1860, sweeping the North to gain victory. Pro-slavery elements in the South viewed his election as a threat to slavery, and Southern states began seceding from the nation. They formed the Confederate States of America, which began seizing federal military bases in the South. A little over one month after Lincoln assumed the presidency, Confederate forces attacked Fort Sumter, a U.S. fort in South Carolina. Following the bombardment, Lincoln mobilized forces to suppress the rebellion and restore the union.\n</p><p>Lincoln, a moderate Republican, had to navigate a contentious array of factions with friends and opponents from both the Democratic and Republican parties. His allies, the War Democrats and the Radical Republicans, demanded harsh treatment of the Southern Confederates. He managed the factions by exploiting their mutual enmity, carefully distributing political patronage, and by appealing to the American people. Anti-war Democrats (called \"Copperheads\") despised Lincoln, and some irreconcilable pro-Confederate elements went so far as to plot his assassination. His Gettysburg Address became one of the most famous speeches in American history. Lincoln closely supervised the strategy and tactics in the war effort, including the selection of generals, and implemented a naval blockade of the South's trade. He suspended <i>habeas corpus</i> in Maryland and elsewhere, and he averted war with Britain by defusing the <i>Trent</i> Affair. In 1863, he issued the Emancipation Proclamation, which declared the slaves in the states \"in rebellion\" to be free. It also directed the Army and Navy to \"recognize and maintain the freedom of said persons\" and to receive them \"into the armed service of the United States.\" Lincoln unsuccessfully pressured border states to outlaw slavery, and he promoted the Thirteenth Amendment to the U.S. Constitution, which abolished slavery, except as punishment for a crime. Lincoln managed his own successful re-election campaign. He sought to heal the war-torn nation through reconciliation. On April 14, 1865, just five days after the Confederate surrender at Appomattox, he was attending a play at Ford's Theatre in Washington, D.C., with his wife, Mary, when he was fatally shot by Confederate sympathizer John Wilkes Booth.\n</p><p>Lincoln is remembered as a martyr and a national hero for his wartime leadership and for his efforts to preserve the Union and abolish slavery. Lincoln is often ranked in both popular and scholarly polls as the greatest president in American history.\n</p>"}
{"firstName":"Andrew","lastName":"Johnson","dob":"1808-12-29","dod":"1875-07-31","presidentNumber":17,"terms":1,"party":"National Union","birthplace":{"city":"Raleigh","state":"North Carolina","latitude":35.7796,"longitude":-78.6382},"image":"andrew-johnson.jpg","vicePresidents":[],"firstLadies":[{"firstName":"Eliza","lastName":"Johnson","dob":"1810-10-04","dod":"1876-01-15"}],"description":"<p><b>Andrew Johnson</b> (December 29, 1808 - July 31, 1875) was the 17th president of the United States, serving from 1865 to 1869. He assumed the presidency following the assassination of Abraham Lincoln, as he was vice president at that time. Johnson was a Democrat who ran with Abraham Lincoln on the National Union Party ticket, coming to office as the Civil War concluded. He favored quick restoration of the seceded states to the Union without protection for the newly freed people who were formerly enslaved as well as pardoning ex-Confederates. This led to conflict with the Republican-dominated Congress, culminating in his impeachment by the House of Representatives in 1868. He was acquitted in the Senate by one vote.\n</p><p>Johnson was born into poverty and never attended school. He was apprenticed as a tailor and worked in several frontier towns before settling in Greeneville, Tennessee, serving as an alderman and mayor before being elected to the Tennessee House of Representatives in 1835. After briefly serving in the Tennessee Senate, Johnson was elected to the House of Representatives in 1843, where he served five two-year terms. He became governor of Tennessee for four years, and was elected by the legislature to the Senate in 1857. During his congressional service, he sought passage of the Homestead Bill which was enacted soon after he left his Senate seat in 1862. Southern slave states seceded to form the Confederate States of America, including Tennessee, but Johnson remained firmly with the Union. He was the only sitting senator from a Confederate state who did not promptly resign his seat upon learning of his state's secession. In 1862, Lincoln appointed him as Military Governor of Tennessee after most of it had been retaken. In 1864, Johnson was a logical choice as running mate for Lincoln, who wished to send a message of national unity in his re-election campaign, and became vice president after a victorious election in 1864.\n</p><p>Johnson implemented his own form of Presidential Reconstruction, a series of proclamations directing the seceded states to hold conventions and elections to reform their civil governments. Southern states returned many of their old leaders and passed Black Codes to deprive the freedmen of many civil liberties, but Congressional Republicans refused to seat legislators from those states and advanced legislation to overrule the Southern actions. Johnson vetoed their bills, and Congressional Republicans overrode him, setting a pattern for the remainder of his presidency. Johnson opposed the Fourteenth Amendment which gave citizenship to former slaves. In 1866, he went on an unprecedented national tour promoting his executive policies, seeking to break Republican opposition. As the conflict grew between the branches of government, Congress passed the Tenure of Office Act restricting Johnson's ability to fire Cabinet officials. He persisted in trying to dismiss Secretary of War Edwin Stanton, but ended up being impeached by the House of Representatives and narrowly avoided conviction in the Senate. He did not win the 1868 Democratic presidential nomination and left office the following year.\n</p><p>Johnson returned to Tennessee after his presidency and gained some vindication when he was elected to the Senate in 1875, making him the only president to afterwards serve in the Senate. He died five months into his term. Johnson's strong opposition to federally guaranteed rights for black Americans is widely criticized. Historians have consistently ranked him one of the worst presidents in American history.\n</p>"}
{"firstName":"Ulysses","lastName":"Grant","dob":"1822-04-27","dod":"1885-07-23","presidentNumber":18,"terms":2,"party":"Republican","birthplace":{"city":"Point Pleasant","state":"Ohio","latitude":38.9431,"longitude":-84.1797},"image":"ulysses-s-grant.jpg","vicePresidents":[{"firstName":"Schuyler","lastName":"Colfax","dob":"1823-03-23","dod":"1885-01-13","presidentNumber":17,"terms":1,"party":"Republican"},{"firstName":"Henry","lastName":"Wilson","dob":"1812-02-16","dod":"1875-11-22","presidentNumber":18,"terms":1,"party":"Republican"}],"firstLadies":[{"firstName":"Julia","lastName":"Grant","dob":"1826-01-26","dod":"1902-12-14"}],"description":"<p><b>Ulysses S. Grant</b> (born <b>Hiram Ulysses Grant</b>; April 27, 1822 - July 23, 1885) was an American military officer and politician who served as the 18th president of the United States from 1869 to 1877. As commanding general, Grant led the Union Army to victory in the American Civil War in 1865.\n</p><p>Grant was born in Ohio and graduated from West Point in 1843. He served with distinction in the Mexican-American War, but resigned from the army in 1854 and returned to civilian life impoverished. In 1861, shortly after the Civil War began, Grant joined the Union Army and rose to prominence after securing victories in the western theater. In 1863, he led the Vicksburg campaign that gave Union forces control of the Mississippi River and dealt a major strategic blow to the Confederacy. President Abraham Lincoln promoted Grant to lieutenant general and command of all Union armies after his victory at Chattanooga. For thirteen months, Grant fought Robert E. Lee during the high-casualty Overland Campaign which ended with the capture of Lee's army at Appomattox, where he formally surrendered to Grant. In 1866, President Andrew Johnson promoted Grant to General of the Army. Later, Grant broke with Johnson over Reconstruction policies. A war hero, drawn in by his sense of duty, Grant was unanimously nominated by the Republican Party and then elected president in 1868.\n</p><p>As president, Grant stabilized the post-war national economy, supported congressional Reconstruction and the Fifteenth Amendment, and prosecuted the Ku Klux Klan. Under Grant, the Union was completely restored. An effective civil rights executive, Grant signed a bill to create the United States Department of Justice and worked with Radical Republicans to protect African Americans during Reconstruction. In 1871, he created the first Civil Service Commission, advancing the civil service more than any prior president. Grant was re-elected in the 1872 presidential election, but was inundated by executive scandals during his second term. His response to the Panic of 1873 was ineffective in halting the Long Depression, which contributed to the Democrats winning the House majority in 1874. Grant's Native American policy was to assimilate Indians into Anglo-American culture. In Grant's foreign policy, the <i>Alabama</i> Claims against Britain were peacefully resolved, but the Senate rejected Grant's annexation of Santo Domingo. In the disputed 1876 presidential election, Grant facilitated the approval by Congress of a peaceful compromise.\n</p><p>Leaving office in 1877, Grant undertook a world tour, becoming the first president to circumnavigate the world. In 1880, he was unsuccessful in obtaining the Republican nomination for a third term. In 1885, impoverished and dying of throat cancer, Grant wrote his memoirs, covering his life through the Civil War, which were posthumously published and became a major critical and financial success. At his death, Grant was the most popular American and was memorialized as a symbol of national unity. Due to the pseudohistorical and negationist mythology of the Lost Cause of the Confederacy spread by Confederate sympathizers around the turn of the 20th century, historical assessments and rankings of Grant's presidency suffered considerably before they began recovering in the 21st century. Grant's critics take a negative view of his economic mismanagement and the corruption within his administration, while his admirers emphasize his policy towards Native Americans, vigorous enforcement of civil and voting rights for African Americans, and securing North and South as a single nation within the Union. Modern scholarship has better appreciated Grant's appointments of Cabinet reformers.\n</p>"}
{"firstName":"Rutherford","lastName":"Hayes","dob":"1822-10-04","dod":"1893-01-17","presidentNumber":19,"terms":1,"party":"Republican","birthplace":{"city":"Delaware","state":"Ohio","latitude":40.2987,"longitude":-83.0680},"image":"rutherford-hayes.jpg","vicePresidents":[{"firstName":"William","lastName":"Wheeler","dob":"1819-06-30","dod":"1887-06-04","presidentNumber":19,"terms":1,"party":"Republican"}],"firstLadies":[{"firstName":"Lucy","lastName":"Hayes","dob":"1831-08-28","dod":"1889-06-25"}],"description":"<p><b>Rutherford Birchard Hayes</b> (<span></span>; October 4, 1822 – January 17, 1893) was an American military officer, lawyer, and politician who served as the 19th president of the United States from 1877 to 1881. \n</p><p>As an attorney in Ohio, Hayes served as Cincinnati's city solicitor from 1858 to 1861. He was a staunch abolitionist who defended refugee slaves in court proceedings. At the start of the American Civil War, he left a fledgling political career to join the Union Army as an officer. Hayes was wounded five times, most seriously at the Battle of South Mountain in 1862. He earned a reputation for bravery in combat, rising in the ranks to serve as brevet major general. After the war, he earned a reputation in the Republican Party as a prominent member of the \"Half-Breed\" faction. He served in Congress from 1865 to 1867 and was elected governor of Ohio, serving two consecutive terms from 1868 to 1872 and half of a third two-year term from 1876 to 1877 before his swearing-in as president.\n</p><p>Hayes won the Republican nomination for president in the 1876 United States presidential election. In the disputed general election, he faced Democratic nominee Samuel J. Tilden. Hayes lost the popular vote to Tilden; neither candidate secured enough electoral votes to win the election. Hayes secured a victory when a Congressional Commission awarded him 20 contested electoral votes in the Compromise of 1877. The electoral dispute was resolved with a backroom deal whereby both Southern Democrats and Whiggish Republican businessmen acquiesced to Hayes's election on the condition that he end both federal support for Reconstruction and the military occupation of the former Confederate States.\n</p><p>Hayes's administration was influenced by his belief in meritocratic government and equal treatment without regard to wealth, social standing, or race. One of the defining events of his presidency was the Great Railroad Strike of 1877, which he resolved by calling in the US Army against the railroad workers. It remains the deadliest conflict between workers and strikebreakers in American history. As president, Hayes implemented modest civil-service reforms that laid the groundwork for further reform in the 1880s and 1890s. He vetoed the Bland–Allison Act of 1878, which put silver money into circulation and raised nominal prices, but Congress overrode his veto. His policy toward western Indians anticipated the assimilationist program of the Dawes Act of 1887. At the end of his term, Hayes kept his pledge not to run for reelection and retired to his home in Ohio. Historians and scholars generally rank Hayes as an average to below-average president.\n</p>"}
{"firstName":"James","lastName":"Garfield","dob":"1831-11-19","dod":"1881-09-19","presidentNumber":20,"terms":1,"party":"Republican","birthplace":{"city":"Moreland Hills","state":"Ohio","latitude":41.4378,"longitude":-81.4393},"image":"james-garfield.jpg","vicePresidents":[{"firstName":"Chester","lastName":"Arthur","dob":"1829-10-05","dod":"1886-11-18","presidentNumber":20,"terms":1,"party":"Republican"}],"firstLadies":[{"firstName":"Lucretia","lastName":"Garfield","dob":"1832-04-19","dod":"1918-03-14"}],"description":"<p><b>James Abram Garfield</b> (November 19, 1831 - September 19, 1881) was the 20th president of the United States, serving from March 1881 until his assassination in September that year. A preacher, lawyer, and Civil War general, Garfield served nine terms in the United States House of Representatives and is the only sitting member of the House to be elected president. Before his candidacy for the presidency, he had been elected to the U.S. Senate by the Ohio General Assembly -- a position he declined when he became president-elect.\n</p><p>Garfield was born into poverty in a log cabin and grew up in northeastern Ohio. After graduating from Williams College, he studied law and became an attorney. He was a preacher in the Stone-Campbell Movement and president of the Western Reserve Eclectic Institute, affiliated with the Disciples. Garfield was elected as a Republican member of the Ohio State Senate in 1859, serving until 1861. He opposed Confederate secession, was a major general in the Union Army during the American Civil War, and fought in the battles of Middle Creek, Shiloh, and Chickamauga. He was elected to Congress in 1862 to represent Ohio's 19th district. Throughout his congressional service, he firmly supported the gold standard and gained a reputation as a skilled orator. He initially agreed with Radical Republican views on Reconstruction but later favored a Moderate Republican-aligned approach to civil rights enforcement for freedmen. Garfield's aptitude for mathematics extended to his own proof of the Pythagorean theorem, which he published in 1876.\n</p><p>At the 1880 Republican National Convention, delegates chose Garfield, who had not sought the White House, as a compromise presidential nominee on the 36th ballot. In the 1880 presidential election, he conducted a low-key front porch campaign and narrowly defeated the Democratic nominee, Winfield Scott Hancock. Garfield's accomplishments as president included his assertion of presidential authority against senatorial courtesy in executive appointments, a purge of corruption in the Post Office, and his appointment of a Supreme Court justice. He advocated for agricultural technology, an educated electorate, and civil rights for African Americans. He also proposed substantial civil service reforms, which were passed by Congress in 1883 as the Pendleton Civil Service Reform Act and signed into law by his successor, Chester A. Arthur.\n</p><p>Garfield was a member of the intraparty \"Half-Breed\" faction who used the powers of the presidency to defy the powerful \"Stalwart\" Senator Roscoe Conkling from New York. He did this by appointing Blaine faction leader William H. Robertson to the lucrative post of Collector of the Port of New York. The ensuing political battle resulted in Robertson's confirmation and the resignations of Conkling and Thomas C. Platt from the Senate.\n</p><p>On July 2, 1881, Charles J. Guiteau, a disappointed and delusional office seeker, shot Garfield at the Baltimore and Potomac Railroad Station in Washington. The wound was not immediately fatal, but an infection caused by his doctors' unsanitary methods in treating the wound killed Garfield on September 19. Due to his brief tenure in office, historians tend to rank Garfield as a below-average president, though he has earned praise for anti-corruption and pro-civil rights stances.\n</p>"}
{"firstName":"Chester","lastName":"Arthur","dob":"1829-10-05","dod":"1886-11-18","presidentNumber":21,"terms":1,"party":"Republican","birthplace":{"city":"Fairfield","state":"Vermont","latitude":44.6354,"longitude":-73.2673},"image":"chester-arthur.jpg","vicePresidents":[],"firstLadies":[{"firstName":"Ellen","lastName":"Arthur","dob":"1837-08-30","dod":"1880-01-12"}],"description":"<p><b>Chester Alan Arthur</b> (October 5, 1829 - November 18, 1886) was an American politician who served as the 21st president of the United States from 1881 to 1885. He was a Republican lawyer from New York who briefly served as the 20th vice president under President James A. Garfield. Assuming the presidency after Garfield's death, Arthur served the remainder of his term until March 4, 1885.\n</p><p>Arthur was born in Fairfield, Vermont, grew up in upstate New York and practiced law in New York City. He served as quartermaster general of the New York Militia during the American Civil War. Following the war, he devoted more time to New York Republican politics and quickly rose in Senator Roscoe Conkling's political organization. President Ulysses S. Grant appointed him as Collector of the Port of New York in 1871, and he was an important supporter of Conkling and the Stalwart faction of the Republican Party. In 1878, following bitter disputes between Conkling and President Rutherford B. Hayes over control of patronage in New York, Hayes fired Arthur as part of a plan to reform the federal patronage system. In June 1880, the extended contest between Grant, identified with the Stalwarts, and James G. Blaine, the candidate of the Half-Breed faction, led to the compromise selection of Ohio's Garfield for president. Republicans then nominated Arthur for vice president to balance the ticket geographically and to placate Stalwarts disappointed by Grant's defeat. Garfield and Arthur won the 1880 presidential election and took office in March 1881. Four months into his term, Garfield was shot by an assassin; he died 11 weeks later, and Arthur assumed the presidency.\n</p><p>As president, Arthur presided over the rebirth of the U.S. Navy, but he was criticized for failing to alleviate the federal budget surplus which had been accumulating since the end of the Civil War. Arthur vetoed the first version of the 1882 Chinese Exclusion Act, arguing that its twenty-year ban on Chinese immigrants to the United States violated the Burlingame Treaty, but he signed a second version, which included a ten-year ban. He appointed Horace Gray and Samuel Blatchford to the Supreme Court. He also enforced the Immigration Act of 1882 to impose more restrictions on immigrants and the Tariff of 1883 to attempt to reduce tariffs. Arthur signed into law the Pendleton Civil Service Reform Act of 1883, which came as a surprise to reformers who held a negative reputation of Arthur as a Stalwart and product of Conkling's organization.\n</p><p>Suffering from poor health, Arthur made only a limited effort to secure the Republican Party's nomination in 1884, and he retired at the end of his term. Arthur's failing health and political temperament combined to make his administration less active than a modern presidency, yet he earned praise among contemporaries for his solid performance in office. Journalist Alexander McClure wrote, \"No man ever entered the Presidency so profoundly and widely distrusted as Chester Alan Arthur, and no one ever retired ... more generally respected, alike by political friend and foe.\" \nThe <i>New York World</i> summed up Arthur's presidency at his death in 1886: \"No duty was neglected in his administration, and no adventurous project alarmed the nation.\" Mark Twain wrote of him, \"It would be hard indeed to better President Arthur's administration.\" Evaluations by modern historians generally rank Arthur as a mediocre or average president. Arthur has also been described as one of the least memorable presidents.\n</p>"}
{"firstName":"Grover","lastName":"Cleveland","dob":"1837-03-18","dod":"1908-06-24","presidentNumber":22,"terms":2,"party":"Democratic","birthplace":{"city":"Caldwell","state":"New Jersey","latitude":40.8398,"longitude":-74.2765},"image":"grover-cleveland.jpg","vicePresidents":[{"firstName":"Thomas","lastName":"Hendricks","dob":"1819-09-07","dod":"1885-11-25","presidentNumber":21,"terms":1,"party":"Democratic"},{"firstName":"Adlai","lastName":"Stevenson","dob":"1835-10-23","dod":"1914-06-14","presidentNumber":23,"terms":1,"party":"Democratic"}],"firstLadies":[{"firstName":"Frances","lastName":"Cleveland","dob":"1864-07-21","dod":"1947-10-29"}],"description":"<p><b>Stephen Grover Cleveland</b> (March 18, 1837 - June 24, 1908) was an American politician who served as the 22nd and 24th president of the United States from 1885 to 1889 and from 1893 to 1897. He is the only U.S. president to serve non-consecutive presidential terms. Cleveland was the first Democrat to win the presidency after the Civil War, and was one of two Democratic presidents, followed by Woodrow Wilson in 1912, in an era when Republicans dominated the presidency between 1869 and 1933. He won the popular vote in three presidential elections -- 1884, 1888, and 1892. Benjamin Harrison won the electoral college vote, and thus the presidency, in 1888.\n</p><p>Cleveland was elected mayor of Buffalo in 1881 and governor of New York in 1882. While governor, he closely cooperated with state assembly minority leader Theodore Roosevelt to pass reform measures, winning national attention. He led the Bourbon Democrats, a pro-business movement opposed to high tariffs, free silver, inflation, imperialism, and subsidies to businesses, farmers, or veterans. His crusade for political reform and fiscal conservatism made him an icon for American conservatives of the time. Cleveland also won praise for honesty, self-reliance, integrity, and commitment to the principles of classical liberalism. His fight against political corruption, patronage, and bossism convinced many like-minded Republicans, called \"Mugwumps\", to cross party lines and support him in the 1884 election. After losing the 1888 election to Harrison, he moved to New York City and joined a law firm. The 1892 election restored him to the White House. As his second administration began, the Panic of 1893 sparked a severe national depression. Many voters blamed the Democrats, opening the way for a Republican landslide in 1894 and for the agrarian and silverite seizure of the Democratic Party in 1896. An anti-imperialist, Cleveland opposed the push to annex Hawaii, launched an investigation into the 1893 coup against Queen Liliuokalani, and called for her to be restored.\n</p><p>Cleveland was a formidable policymaker, but also garnered criticism. He intervened in the 1894 Pullman Strike to keep the railroads moving, angering Illinois Democrats and labor unions nationwide; his support of the gold standard and opposition to free silver alienated the agrarian wing of the Democrats. Critics complained that Cleveland had little imagination and seemed overwhelmed by the nation's economic disasters -- depressions and strikes -- in his second term. Even so, his reputation for probity and good character survived the troubles of his second term. Biographer Allan Nevins wrote, \"[I]n Grover Cleveland, the greatness lies in typical rather than unusual qualities. He had no endowments that thousands of men do not have. He possessed honesty, courage, firmness, independence, and common sense. But he possessed them to a degree other men do not.\" By the end of his second term, he was severely unpopular, even among Democrats. \n</p><p>After leaving the White House, Cleveland served as a trustee of Princeton University. He continued to voice his political views, but fell seriously ill in 1907, dying in 1908. Today, Cleveland is praised for honesty, integrity, adherence to his morals, defying party boundaries, and effective leadership and is typically ranked in the middle to upper tier of U.S. presidents.\n</p>"}
{"firstName":"Benjamin","lastName":"Harrison","dob":"1833-08-20","dod":"1901-03-13","presidentNumber":23,"terms":1,"party":"Republican","birthplace":{"city":"North Bend","state":"Ohio","latitude":39.1480,"longitude":-84.8535},"image":"benjamin-harrison.jpg","vicePresidents":[{"firstName":"Levi","lastName":"Morton","dob":"1824-05-16","dod":"1920-05-16","presidentNumber":22,"terms":1,"party":"Republican"}],"firstLadies":[{"firstName":"Caroline","lastName":"Harrison","dob":"1832-10-01","dod":"1892-10-25"},{"firstName":"Mary","lastName":"Harrison","dob":"1858-04-03","dod":"1948-01-05"}],"description":"<p><b>Benjamin Harrison</b> (August 20, 1833 - March 13, 1901) was the 23rd president of the United States, serving from 1889 to 1893. He was a member of the Harrison family of Virginia -- a grandson of the ninth president, William Henry Harrison, and a great-grandson of Benjamin Harrison V, a Founding Father. A Union Army veteran and a Republican, he defeated incumbent Grover Cleveland to win the presidency.\n</p><p>Harrison was born on a farm by the Ohio River and graduated from Miami University in Oxford, Ohio. After moving to Indianapolis, he established himself as a prominent local attorney, Presbyterian church leader, and politician in Indiana. During the American Civil War, he served in the Union Army as a colonel, and was confirmed by the U.S. Senate as a brevet brigadier general of volunteers in 1865. Harrison unsuccessfully ran for governor of Indiana in 1876. The Indiana General Assembly elected Harrison to a six-year term in the Senate, where he served from 1881 to 1887.\n</p><p>A Republican, Harrison was elected to the presidency in 1888, defeating the Democratic incumbent Grover Cleveland in the Electoral College while losing the popular vote. Hallmarks of Harrison's administration were unprecedented economic legislation, including the McKinley Tariff, which imposed historic protective trade rates, and the Sherman Antitrust Act. Harrison also facilitated the creation of the national forest reserves through an amendment to the Land Revision Act of 1891. During his administration six western states were admitted to the Union. In addition, Harrison substantially strengthened and modernized the U.S. Navy and conducted an active foreign policy, but his proposals to secure federal education funding as well as voting rights enforcement for African Americans were unsuccessful.\n</p><p>Due in large part to surplus revenues from the tariffs, federal spending reached one billion dollars for the first time during his term. The spending issue in part led to the Republicans' defeat in the 1890 midterm elections. Cleveland defeated Harrison for reelection in 1892, due to the growing unpopularity of high tariffs and high federal spending. Harrison returned to private life and his law practice in Indianapolis. In 1899 he represented Venezuela in its British Guiana boundary dispute with Great Britain. Harrison traveled to the court in Paris as part of the case and after a brief stay returned to Indianapolis. He died at his home in Indianapolis in 1901 of complications from influenza. Many have praised Harrison's commitment to African Americans' voting rights, his work ethic, and his integrity, but scholars and historians generally rank him as an average president, due to the uneventful nature of his term.\n</p>"}
{"firstName":"William","lastName":"McKinley","dob":"1843-01-29","dod":"1901-09-14","presidentNumber":25,"terms":2,"party":"Republican","birthplace":{"city":"Niles","state":"Ohio","latitude":41.1828,"longitude":-80.7658},"image":"william-mckinley.jpg","vicePresidents":[{"firstName":"Garret","lastName":"Hobart","dob":"1844-06-03","dod":"1899-11-21","presidentNumber":24,"terms":1,"party":"Republican"},{"firstName":"Theodore","lastName":"Roosevelt","dob":"1858-10-27","dod":"1919-01-06","presidentNumber":26,"terms":2,"party":"Republican"}],"firstLadies":[{"firstName":"Ida","lastName":"McKinley","dob":"1847-06-08","dod":"1907-05-26"}],"description":"<p><b>William McKinley</b> (January 29, 1843 - September 14, 1901) was the 25th president of the United States, serving from 1897 until his assassination in 1901. A member of the Republican Party, he led a realignment that made Republicans largely dominant in the industrial states and nationwide for decades. He presided over victory in the Spanish-American War of 1898; gained control of Hawaii, Puerto Rico, Guam, and the Philippines; restored prosperity after a deep depression; rejected the inflationary monetary policy of free silver, keeping the nation on the gold standard; and raised protective tariffs.\n</p><p>McKinley was the last president to have served in the American Civil War; he was the only one to begin his service as an enlisted man and ended it as a brevet major. After the war, he settled in Canton, Ohio, where he practiced law and married Ida Saxton. In 1876, McKinley was elected to Congress, where he became the Republican expert on the protective tariff, which he believed would bring prosperity. His 1890 McKinley Tariff was highly controversial and, together with a Democratic redistricting aimed at gerrymandering him out of office, led to his defeat in the Democratic landslide of 1890. He was elected governor of Ohio in 1891 and 1893, steering a moderate course between capital and labor interests. He secured the Republican nomination for president in 1896 amid a deep economic depression and defeated his Democratic rival William Jennings Bryan after a front porch campaign in which he advocated \"sound money\" (the gold standard unless altered by international agreement) and promised that high tariffs would restore prosperity. Historians regard McKinley's victory as a realigning election in which the political stalemate of the post-Civil War era gave way to the Republican-dominated Fourth Party System, beginning with the Progressive Era.\n</p><p>McKinley's presidency saw rapid economic growth. He promoted the 1897 Dingley Tariff to protect manufacturers and factory workers from foreign competition and, in 1900, secured the passage of the Gold Standard Act. He hoped to persuade Spain to grant independence to rebellious Cuba without conflict. Still, when negotiation failed, he requested and signed Congress's declaration of war to begin the Spanish-American War of 1898, in which the United States saw a quick and decisive victory. As part of the peace settlement, Spain turned over to the United States its main overseas colonies of Puerto Rico, Guam and the Philippines, while Cuba was promised independence but remained under the control of the United States Army until May 20, 1902. The United States annexed the independent Republic of Hawaii in 1898, and it became a United States territory.\n</p><p>McKinley defeated Bryan again in the 1900 presidential election in a campaign focused on imperialism, protectionism, and free silver. His second term ended early when he was shot on September 6, 1901, by Leon Czolgosz, an anarchist. McKinley died eight days later and was succeeded by Vice President Theodore Roosevelt. As an innovator of American interventionism and pro-business sentiment, McKinley is generally ranked as an above-average president. However, his take-over of the Philippines is often criticized as an act of imperialism. His popularity was soon overshadowed by Roosevelt's.\n</p>"}
{"firstName":"Theodore","lastName":"Roosevelt","dob":"1858-10-27","dod":"1919-01-06","presidentNumber":26,"terms":2,"party":"Republican","birthplace":{"city":"New York City","state":"New York","latitude":40.7128,"longitude":-74.0060},"image":"theodore-roosevelt.jpg","vicePresidents":[{"firstName":"Charles","lastName":"Fairbanks","dob":"1852-05-11","dod":"1918-06-04","presidentNumber":26,"terms":1,"party":"Republican"}],"firstLadies":[{"firstName":"Edith","lastName":"Roosevelt","dob":"1861-08-06","dod":"1948-09-30"}],"description":"<p><b>Theodore  Roosevelt Jr.</b> (October 27, 1858 - January 6, 1919), often referred to as <b>Teddy</b> or <b>T. R.</b>, was an American politician, soldier, conservationist, historian, naturalist, explorer and writer who served as the 26th president of the United States from 1901 to 1909. He previously was involved in New York politics, including serving as the state's 33rd governor for two years. He was the vice president under President William McKinley for six months in 1901, assuming the presidency after McKinley's assassination. As president, Roosevelt emerged as a leader of the Republican Party and became a driving force for anti-trust and Progressive policies.\n</p><p>A sickly child with debilitating asthma, Roosevelt overcame health problems through a strenuous lifestyle. He was home-schooled and began a lifelong naturalist avocation before attending Harvard College. His book <i>The Naval War of 1812</i> established his reputation as a historian and popular writer. Roosevelt became the leader of the reform faction of Republicans in the New York State Legislature. His first wife and mother died on the same night, devastating him psychologically. He recuperated by buying and operating a cattle ranch in the Dakotas. Roosevelt served as assistant secretary of the Navy under McKinley, and in 1898 helped plan the successful naval war against Spain. He resigned to help form and lead the Rough Riders, a unit that fought the Spanish Army in Cuba to great publicity. Returning a war hero, Roosevelt was elected New York's governor in 1898. The New York state party leadership disliked his ambitious agenda and convinced McKinley to choose him as his running mate in the 1900 presidential election; the McKinley-Roosevelt ticket won a landslide victory.\n</p><p>Roosevelt assumed the presidency aged 42, and is the youngest person to become US president. As a leader of the progressive movement, he championed his \"Square Deal\" domestic policies, which called for fairness for all citizens, breaking bad trusts, regulating railroads, and pure food and drugs. Roosevelt prioritized conservation and established national parks, forests, and monuments to preserve America's natural resources. In foreign policy, he focused on Central America, beginning construction of the Panama Canal. Roosevelt expanded the Navy and sent the Great White Fleet on a world tour to project naval power. His successful efforts to end the Russo-Japanese War won him the 1906 Nobel Peace Prize, the first American to win a Nobel Prize. Roosevelt was elected to a full term in 1904 and groomed William Howard Taft to succeed him in 1908.\n</p><p>Roosevelt grew frustrated with Taft's brand of conservatism and tried, and failed, to win the 1912 Republican presidential nomination. He founded the new Progressive Party and ran in 1912; the split allowed the Democratic Woodrow Wilson to win. Roosevelt led a four-month expedition to the Amazon basin, where he nearly died of tropical disease. During World War I, he criticized Wilson for keeping the US out; his offer to lead volunteers to France was rejected. Roosevelt's health deteriorated and he died in 1919. Polls of historians and political scientists rank him as one of the greatest American presidents.\n</p>"}
{"firstName":"William","lastName":"Taft","dob":"1857-09-15","dod":"1930-03-08","presidentNumber":27,"terms":1,"party":"Republican","birthplace":{"city":"Cincinnati","state":"Ohio","latitude":39.1031,"longitude":-84.5120},"image":"william-taft.jpg","vicePresidents":[{"firstName":"James","lastName":"Sherman","dob":"1855-10-24","dod":"1912-10-30","presidentNumber":27,"terms":1,"party":"Republican"}],"firstLadies":[{"firstName":"Helen","lastName":"Taft","dob":"1861-06-02","dod":"1943-05-22"}],"description":"<p><b>William Howard Taft</b> (September 15, 1857 - March 8, 1930) was the 27th president of the United States, serving from 1909 to 1913, and the tenth chief justice of the United States, serving from 1921 to 1930, the only person to have held both offices. Taft was elected president in 1908, the chosen successor of Theodore Roosevelt, but was defeated for reelection in 1912 by Woodrow Wilson after Roosevelt split the Republican vote by running as a third-party candidate. In 1921, President Warren G. Harding appointed Taft to be chief justice, a position he held until a month before his death.\n</p><p>Taft was born in Cincinnati, Ohio in 1857. His father, Alphonso Taft, was a U.S. attorney general and secretary of war. Taft attended Yale and joined the Skull and Bones, of which his father was a founding member. After becoming a lawyer, Taft was appointed a judge while still in his twenties. He continued a rapid rise, being named solicitor general and a judge of the Sixth Circuit Court of Appeals. In 1901, President William McKinley appointed Taft civilian governor of the Philippines. In 1904, Roosevelt made him Secretary of War, and he became Roosevelt's hand-picked successor. Despite his personal ambition to become chief justice, Taft declined repeated offers of appointment to the Supreme Court of the United States, believing his political work to be more important.\n</p><p>With Roosevelt's help, Taft had little opposition for the Republican nomination for president in 1908 and easily defeated William Jennings Bryan for the presidency in that November's election. In the White House, he focused on East Asia more than European affairs and repeatedly intervened to prop up or remove Latin American governments. Taft sought reductions to trade tariffs, then a major source of governmental income, but the resulting bill was heavily influenced by special interests. His administration was filled with conflict between the Republican Party's conservative wing, with which Taft often sympathized, and its progressive wing, toward which Roosevelt moved more and more. Controversies over conservation and antitrust cases filed by the Taft administration served to further separate the two men. Roosevelt challenged Taft for renomination in 1912. Taft used his control of the party machinery to gain a bare majority of delegates and Roosevelt bolted the party. The split left Taft with little chance of reelection, and he took only Utah and Vermont in Wilson's victory.\n</p><p>After leaving office, Taft returned to Yale as a professor, continuing his political activity and working against war through the League to Enforce Peace. In 1921, Harding appointed Taft chief justice, an office he had long sought. Chief Justice Taft was a conservative on business issues, and under him there were advances in individual rights. In poor health, he resigned in February 1930, and died the following month. He was buried at Arlington National Cemetery, the first president and first Supreme Court justice to be interred there. Taft is generally listed near the middle in historians' rankings of U.S. presidents.\n</p>"}
{"firstName":"Woodrow","lastName":"Wilson","dob":"1856-12-28","dod":"1924-02-03","presidentNumber":28,"terms":2,"party":"Democratic","birthplace":{"city":"Staunton","state":"Virginia","latitude":38.1496,"longitude":-79.0717},"image":"woodrow-wilson.jpg","vicePresidents":[{"firstName":"Thomas","lastName":"Marshall","dob":"1854-03-14","dod":"1925-06-01","presidentNumber":28,"terms":2,"party":"Democratic"}],"firstLadies":[{"firstName":"Ellen","lastName":"Wilson","dob":"1860-05-15","dod":"1914-08-06"},{"firstName":"Edith","lastName":"Wilson","dob":"1872-10-15","dod":"1961-12-28"}],"description":"<p><b>Thomas Woodrow Wilson</b> (December 28, 1856 - February 3, 1924) was an American politician and academic who served as the 28th president of the United States from 1913 to 1921. A member of the Democratic Party, Wilson served as the president of Princeton University and as the governor of New Jersey before winning the 1912 presidential election. As president, Wilson changed the nation's economic policies and led the United States into World War I in 1917. He was the leading architect of the League of Nations, and his progressive stance on foreign policy came to be known as Wilsonianism.\n</p><p>Born in Staunton, Virginia, Wilson grew up in the Southern United States during the American Civil War and Reconstruction era. After earning a Ph.D. in history and political science from Johns Hopkins University, Wilson taught at several colleges prior to being appointed president of Princeton University, where he emerged as a prominent spokesman for progressivism in higher education. Wilson served as governor of New Jersey from 1911 to 1913, during which he broke with party bosses and won the passage of several progressive reforms. Wilson defeated incumbent Republican William Howard Taft and third-party nominee Theodore Roosevelt to easily win the 1912 United States presidential election, becoming the first Southerner to do so since 1848. \n</p><p>During his first year as president, Wilson authorized the widespread imposition of segregation inside the federal bureaucracy and his opposition to women's suffrage drew protests. His first term was largely devoted to pursuing passage of his progressive New Freedom domestic agenda. His first major priority was the Revenue Act of 1913, which began the modern income tax, and the Federal Reserve Act, which created the Federal Reserve System. At the outbreak of World War I in 1914, the U.S. declared neutrality as Wilson tried to negotiate a peace between the Allied and Central Powers. He narrowly won re-election in 1916 against Charles Evans Hughes. In April 1917, Wilson asked Congress for a declaration of war against Germany in response to its policy of unrestricted submarine warfare that sank American merchant ships. Wilson concentrated on diplomacy, issuing the <i>Fourteen Points</i> that the Allies and Germany accepted as a basis for post-war peace. He wanted the off-year elections of 1918 to be a referendum endorsing his policies, but instead, the Republicans took control of Congress. After the Allied victory in November 1918, Wilson attended the Paris Peace Conference. Wilson successfully advocated for the establishment of a multinational organization, the League of Nations, which was incorporated into the Treaty of Versailles that he signed, but back home he rejected a Republican compromise that would have allowed the Senate to ratify the Versailles Treaty and join the League.\n</p><p>Wilson had intended to seek a third term in office but had a stroke in October 1919 that left him incapacitated. His wife and his physician controlled Wilson, and no significant decisions were made. Meanwhile, his policies alienated German- and Irish-American Democrats and the Republicans won a landslide in the 1920 presidential election. Scholars have generally ranked Wilson in the upper tier of U.S. presidents, although he has been criticized for supporting racial segregation. His liberalism nevertheless lives on as a major factor in American foreign policy, and his vision of national self-determination resonates globally to this day.\n</p>"}
{"firstName":"Warren","lastName":"Harding","dob":"1865-11-02","dod":"1923-08-02","presidentNumber":29,"terms":1,"party":"Republican","birthplace":{"city":"Blooming Grove","state":"Ohio","latitude":40.6782,"longitude":-82.9428},"image":"warren-harding.jpg","vicePresidents":[{"firstName":"Calvin","lastName":"Coolidge","dob":"1872-07-04","dod":"1933-01-05","presidentNumber":29,"terms":1,"party":"Republican"}],"firstLadies":[{"firstName":"Florence","lastName":"Harding","dob":"1860-08-15","dod":"1924-11-21"}],"description":"<p><b>Warren Gamaliel Harding</b> (November 2, 1865 - August 2, 1923) was the 29th president of the United States, serving from 1921 until his death in 1923. A member of the Republican Party, he was one of the most popular sitting U.S. presidents while in office. After his death, a number of scandals were exposed, including Teapot Dome, as well as an extramarital affair with Nan Britton, which tarnished his reputation.\n</p><p>Harding lived in rural Ohio all his life, except when political service took him elsewhere. As a young man, he bought <i>The Marion Star</i> and built it into a successful newspaper. Harding served in the Ohio State Senate from 1900 to 1904, and was lieutenant governor for two years. He was defeated for governor in 1910, but was elected to the United States Senate in 1914 -- the state's first direct election for that office. Harding ran for the Republican nomination for president in 1920, but was considered a long shot before the convention. When the leading candidates could not garner a majority, and the convention deadlocked, support for Harding increased, and he was nominated on the tenth ballot. He conducted a front porch campaign, remaining mostly in Marion and allowing people to come to him. He promised a return to normalcy of the pre-World War I period, and defeated Democratic nominee James M. Cox in a landslide to become the first sitting senator elected president.\n</p><p>Harding appointed a number of respected figures to his cabinet, including Andrew Mellon at Treasury, Herbert Hoover at Commerce, and Charles Evans Hughes at the State Department. A major foreign policy achievement came with the Washington Naval Conference of 1921-1922, in which the world's major naval powers agreed on a naval limitations program that lasted a decade. Harding released political prisoners who had been arrested for their opposition to World War I. In 1923, Harding died of a heart attack in San Francisco while on a western tour, and was succeeded by Vice President Calvin Coolidge.\n</p><p>Harding died as one of the most popular presidents in history, but the subsequent exposure of scandals eroded his popular regard, as did revelations of extramarital affairs. Harding's interior secretary, Albert B. Fall, and his attorney general, Harry Daugherty, were each later tried for corruption in office. Fall was convicted though Daugherty was not. These trials greatly damaged Harding's posthumous reputation. In historical rankings of the U.S. presidents during the decades after his term in office, Harding was often rated among the worst, but in recent decades, some historians have begun to reassess the conventional views of Harding's historical record in office.\n</p>"}
{"firstName":"Calvin","lastName":"Coolidge","dob":"1872-07-04","dod":"1933-01-05","presidentNumber":30,"terms":1.5,"party":"Republican","birthplace":{"city":"Plymouth Notch","state":"Vermont","latitude":43.5304,"longitude":-72.7382},"image":"calvin-coolidge.jpg","vicePresidents":[{"firstName":"Charles","lastName":"Dawes","dob":"1865-08-27","dod":"1951-04-23","presidentNumber":30,"terms":1,"party":"Republican"}],"firstLadies":[{"firstName":"Grace","lastName":"Coolidge","dob":"1879-01-03","dod":"1957-07-08"}],"description":"<p><b>Calvin Coolidge</b> (July 4, 1872 - January 5, 1933) was an American attorney and politician who served as the 30th president of the United States, from 1923 to 1929. Born in Vermont, Coolidge was a Republican lawyer who climbed the ladder of Massachusetts politics, becoming the state's 48th governor. His prompt and effective response to the Boston police strike of 1919 thrust him into the national spotlight as a man of decisive action. The next year, Coolidge was elected the country's 29th vice president and succeeded to the presidency upon the sudden death of President Warren G. Harding in August 1923. Elected in his own right in 1924, Coolidge gained a reputation as a small-government conservative with a taciturn personality and dry sense of humor that earned him the nickname \"Silent Cal\". His widespread popularity enabled him to run for a second full term, but Coolidge chose not to run again in 1928, remarking that ten years as president would be \"longer than any other man has had it -- too long!\"\n</p><p>During his gubernatorial career, Coolidge ran on the record of fiscal conservatism, strong support for women's suffrage, and vague opposition to Prohibition. During his presidency, he restored public confidence in the White House after the many scandals of the Harding administration. He signed into law the Indian Citizenship Act of 1924, which granted U.S. citizenship to all Native Americans, and oversaw a period of rapid and expansive economic growth known as the \"Roaring Twenties\", leaving office with considerable popularity. He was known for his hands-off governing approach and pro-business stances; biographer Claude Fuess wrote: \"He embodied the spirit and hopes of the middle class, could interpret their longings and express their opinions. That he did represent the genius of the average is the most convincing proof of his strength.\"\n</p><p>Scholars have ranked Coolidge in the lower half of U.S. presidents. He gains nearly universal praise for his stalwart support of racial equality during a period of heightened racial tension in the nation, and is highly praised by advocates of smaller government and <i>laissez-faire</i> economics; supporters of an active central government generally view him far less favorably. His critics argue that he failed to use the country's economic boom to help struggling farmers and workers in other flailing industries, and there is still much debate among historians as to the extent to which Coolidge's economic policies contributed to the onset of the Great Depression.\n</p>"}
{"firstName":"Herbert","lastName":"Hoover","dob":"1874-08-10","dod":"1964-10-20","presidentNumber":31,"terms":1,"party":"Republican","birthplace":{"city":"West Branch","state":"Iowa","latitude":41.6697,"longitude":-91.3462},"image":"herbert-hoover.jpg","vicePresidents":[{"firstName":"Charles","lastName":"Curtis","dob":"1860-01-25","dod":"1936-02-08","presidentNumber":31,"terms":1,"party":"Republican"}],"firstLadies":[{"firstName":"Lou","lastName":"Hoover","dob":"1874-03-29","dod":"1944-01-07"}],"description":"<p><b>Herbert Clark Hoover</b> (August 10, 1874 - October 20, 1964) was an American politician and humanitarian who served as the 31st president of the United States from 1929 to 1933. He was a member of the Republican Party, and held office during the onset of the Great Depression. A wealthy mining engineer before his presidency, Hoover led the wartime Commission for Relief in Belgium and was the director of the U.S. Food Administration, followed by post-war relief of Europe. In the 1920s, he served as the U.S. Secretary of Commerce.\n</p><p>Born to a Quaker family in West Branch, Iowa, Hoover grew up in Oregon. He was one of the first graduates of the new Stanford University in 1895. Hoover took a position with a London-based mining company working in Australia and China. He rapidly became a wealthy mining engineer. In 1914, the outbreak of World War I, he organized and headed the Commission for Relief in Belgium, an international relief organization that provided food to occupied Belgium. When the U.S. entered the war in 1917, President Woodrow Wilson appointed Hoover to lead the Food Administration. He became famous as his country's \"food czar\". After the war, Hoover led the American Relief Administration, which provided food to the starving millions in Central and Eastern Europe, especially Russia. Hoover's wartime service made him a favorite of many progressives, and he unsuccessfully sought the Republican nomination in the 1920 U.S. presidential election.\n</p><p>Hoover served as the secretary of commerce under Presidents Warren G. Harding and Calvin Coolidge. Hoover was an unusually active and visible Cabinet member, becoming known as \"Secretary of Commerce and Under-Secretary of all other departments.\" He was influential in the development of air travel and radio. Hoover led the federal response to the Great Mississippi Flood of 1927. He won the Republican nomination in the 1928 presidential election and defeated Democratic candidate Al Smith in a landslide. In 1929, Hoover assumed the presidency. However, during his first year in office, the stock market crashed, signaling the onset of the Great Depression, which dominated Hoover's presidency until its end. His response to the depression was widely seen as lackluster and he scapegoated Mexican Americans for the economic crisis. Approximately 1.5-2 million Mexican Americans were forcibly \"repatriated\" to Mexico in a forced migration campaign known as the Mexican Repatriation even though a majority of them were born in the United States.\n</p><p>In the midst of the Great Depression, he was decisively defeated by Democratic nominee Franklin D. Roosevelt in the 1932 presidential election. Hoover's retirement was over 31 years long, one of the longest presidential retirements. He authored numerous works and became increasingly conservative in retirement. He strongly criticized Roosevelt's foreign policy and the New Deal. In the 1940s and 1950s, public opinion of Hoover improved, largely due to his service in various assignments for Presidents Harry S. Truman and Dwight D. Eisenhower, including chairing the influential Hoover Commission. Critical assessments of his presidency by historians and political scientists generally rank him as a significantly below-average president, although Hoover has received praise for his actions as a humanitarian and public official.\n</p>"}
{"firstName":"Franklin","lastName":"Roosevelt","dob":"1882-01-30","dod":"1945-04-12","presidentNumber":32,"terms":4,"party":"Democratic","birthplace":{"city":"Hyde Park","state":"New York","latitude":41.7849,"longitude":-73.9345},"image":"franklin-roosevelt.jpg","vicePresidents":[{"firstName":"John","lastName":"Garner","dob":"1868-11-22","dod":"1967-11-07","presidentNumber":32,"terms":2,"party":"Democratic"},{"firstName":"Henry","lastName":"Wallace","dob":"1888-10-07","dod":"1965-11-18","presidentNumber":32,"terms":1,"party":"Democratic"},{"firstName":"Harry","lastName":"Truman","dob":"1884-05-08","dod":"1972-12-26","presidentNumber":32,"terms":1,"party":"Democratic"}],"firstLadies":[{"firstName":"Eleanor","lastName":"Roosevelt","dob":"1884-10-11","dod":"1962-11-07"}],"description":"p><b>Franklin Delano Roosevelt</b> (January 30, 1882 - April 12, 1945), commonly known by his initials <b>FDR</b>, was an American politician who served as the 32nd president of the United States from 1933 until his death in 1945. The longest serving U.S. president, he is the only president to have served more than two terms. His initial two terms were centered on combating the Great Depression, while his third and fourth saw him shift his focus to America's involvement in World War II.\n</p><p>A member of the prominent Delano and Roosevelt families, Roosevelt was elected to the New York State Senate from 1911 to 1913 and was then the assistant secretary of the Navy under President Woodrow Wilson during World War I. Roosevelt was James M. Cox's running mate on the Democratic Party's ticket in the 1920 U.S. presidential election, but Cox lost to Republican nominee Warren G. Harding. In 1921, Roosevelt contracted a paralytic illness that permanently paralyzed his legs. Partly through the encouragement of his wife, Eleanor Roosevelt, he returned to public office as governor of New York from 1929 to 1933, during which he promoted programs to combat the Great Depression. In the 1932 presidential election, Roosevelt defeated president Herbert Hoover in a landslide victory.\n</p><p>During his first 100 days as president, Roosevelt spearheaded unprecedented federal legislation and directed the federal government during most of the Great Depression, implementing the New Deal, building the New Deal coalition, and realigning American politics into the Fifth Party System. He created numerous programs to provide relief to the unemployed and farmers while seeking economic recovery with the National Recovery Administration and other programs. He also instituted major regulatory reforms related to finance, communications, and labor, and presided over the end of Prohibition. In 1936, Roosevelt won a landslide reelection. He was unable to expand the Supreme Court in 1937, the same year the conservative coalition was formed to block the implementation of further New Deal programs and reforms. Major surviving programs and legislation implemented under Roosevelt include the Securities and Exchange Commission, the National Labor Relations Act, the Federal Deposit Insurance Corporation, and Social Security. In 1940, he ran successfully for reelection, one entire term before the official implementation of term limits.\n</p><p>Following the Japanese attack on Pearl Harbor on December 7, 1941, Roosevelt obtained a declaration of war on Japan. After Germany and Italy declared war on the U.S. on December 11, 1941, the U.S. Congress approved additional declarations of war in return. He worked closely with other national leaders in leading the Allies against the Axis powers. Roosevelt supervised the mobilization of the American economy to support the war effort and implemented a Europe first strategy. He also initiated the development of the first atomic bomb and worked with the other Allied leaders to lay the groundwork for the United Nations and other post-war institutions, even coining the term \"United Nations\". Roosevelt won reelection in 1944 but died in 1945 after his physical health seriously and steadily declined during the war years. Since then, several of his actions have come under criticism, such as his ordering of the internment of Japanese Americans. Nonetheless, historical rankings consistently place him among the three greatest American presidents.\n</p>"}
{"firstName":"Harry","lastName":"Truman","dob":"1884-05-08","dod":"1972-12-26","presidentNumber":33,"terms":2,"party":"Democratic","birthplace":{"city":"Lamar","state":"Missouri","latitude":37.4936,"longitude":-94.2700},"image":"harry-truman.jpg","vicePresidents":[{"firstName":"Alben","lastName":"Barkley","dob":"1877-11-24","dod":"1956-04-30","presidentNumber":33,"terms":1,"party":"Democratic"}],"firstLadies":[{"firstName":"Bess","lastName":"Truman","dob":"1885-02-13","dod":"1982-10-18"}],"description":"<p><b>Harry S. Truman</b>  (May 8, 1884 - December 26, 1972) was the 33rd president of the United States, serving from 1945 to 1953. A member of the Democratic Party, he previously served as a United States senator from Missouri from 1935 to 1945 and briefly as the 34th vice president in 1945 under Franklin D. Roosevelt. Assuming the presidency after Roosevelt's death, Truman implemented the Marshall Plan in the wake of World War II to rebuild the economy of Western Europe and established both the Truman Doctrine and NATO to contain the expansion of Soviet communism. He proposed numerous liberal domestic reforms, but few were enacted by the conservative coalition that dominated the Congress.\n</p><p>Truman was raised in Independence, Missouri, and during World War I fought in France as a captain in the Field Artillery. Returning home, he opened a haberdashery in Kansas City, Missouri, and was elected as a judge of Jackson County in 1922. Truman was elected to the United States Senate from Missouri in 1934. Between 1940 and 1944, he gained national prominence as chairman of the Truman Committee, which was aimed at reducing waste and inefficiency in wartime contracts.\n</p><p>Truman was elected vice president in the 1944 presidential election and assumed the presidency upon Roosevelt's death in April 1945. It was only when Truman assumed the presidency that he was informed about the ongoing Manhattan Project and the atomic bomb. Truman authorized the first and only use of nuclear weapons in war against the Japanese cities of Hiroshima and Nagasaki. Truman's administration engaged in an internationalist foreign policy by working closely with Britain. Truman staunchly denounced isolationism. He energized the New Deal coalition during the 1948 presidential election, despite a divided Democratic Party, and won a surprise victory against Republican Party nominee Thomas E. Dewey that secured his own presidential term.\n</p><p>Truman presided over the onset of the Cold War in 1947. He oversaw the Berlin Airlift and Marshall Plan in 1948. With the involvement of the US in the Korean War of 1950-1953, South Korea repelled the invasion by North Korea. Domestically, the postwar economic challenges such as strikes and inflation created a mixed reaction over the effectiveness of his administration. In 1948, he proposed Congress pass comprehensive civil rights legislation. Congress refused, so Truman issued Executive Order 9980 and Executive Order 9981, which prohibited discrimination in federal agencies and desegregated the U.S. Armed Forces.\n</p><p>Investigations revealed corruption in parts of the Truman administration, and this became a major campaign issue in the 1952 presidential election, although they did not implicate Truman himself. He was eligible for reelection in 1952 but, with poor polling, he chose not to run. Truman went into a retirement marked by the founding of his presidential library and the publication of his memoirs. It was long thought that his retirement years were financially difficult for Truman, resulting in Congress establishing a pension for former presidents, but evidence eventually emerged that he amassed considerable wealth, some of it while still president. When he left office, Truman's administration was heavily criticized. Despite this controversy, scholars rank Truman in the first quartile of American presidents. In addition, critical reassessment of his presidency has improved his reputation among historians and the general population. \n</p>"}
{"firstName":"Dwight","lastName":"Eisenhower","dob":"1890-10-14","dod":"1969-03-28","presidentNumber":34,"terms":2,"party":"Republican","birthplace":{"city":"Denison","state":"Texas","latitude":33.7550,"longitude":-96.5367},"image":"dwight-eisenhower.jpg","vicePresidents":[{"firstName":"Richard","lastName":"Nixon","dob":"1913-01-09","dod":"1994-04-22","presidentNumber":34,"terms":2,"party":"Republican"}],"firstLadies":[{"firstName":"Mamie","lastName":"Eisenhower","dob":"1896-11-14","dod":"1979-11-01"}],"description":"<p><b>Dwight David Eisenhower</b> (October 14, 1890 - March 28, 1969), nicknamed <b>Ike</b>, was an American military officer and statesman who served as the 34th president of the United States from 1953 to 1961. During World War II, he was Supreme Commander of the Allied Expeditionary Force in Europe and achieved the five-star rank as General of the Army. Eisenhower planned and supervised two of the most consequential military campaigns of World War II: Operation Torch in the North Africa campaign in 1942-1943 and the invasion of Normandy in 1944.\n</p><p>Eisenhower was born in Denison, Texas, and raised in Abilene, Kansas. His family had a strong religious background, and his mother became a Jehovah's Witness. Eisenhower, however, belonged to no organized church until 1952. He graduated from West Point in 1915 and later married Mamie Doud, with whom he had two sons. During World War I, he was denied a request to serve in Europe and instead commanded a unit that trained tank crews. Between the wars he served in staff positions in the US and the Philippines, reaching the rank of brigadier general shortly before the entry of the US into World War II in 1941. After further promotion Eisenhower oversaw the Allied invasions of North Africa and Sicily before supervising the invasions of France and Germany. After the war ended in Europe, he served as military governor of the American-occupied zone of Germany (1945), Army Chief of Staff (1945-1948), president of Columbia University (1948-1953), and as the first supreme commander of NATO (1951-1952).\n</p><p>In 1952, Eisenhower entered the presidential race as a Republican to block the isolationist foreign policies of Senator Robert A. Taft, who opposed NATO. Eisenhower won that year's election and the 1956 election in landslides, both times defeating Adlai Stevenson II. Eisenhower's main goals in office were to contain the spread of communism and reduce federal deficits. In 1953, he considered using nuclear weapons to end the Korean War and may have threatened China with nuclear attack if an armistice was not reached quickly. China did agree and an armistice resulted, which remains in effect. His New Look policy of nuclear deterrence prioritized \"inexpensive\" nuclear weapons while reducing funding for expensive Army divisions. He continued Harry S. Truman's policy of recognizing Taiwan as the legitimate government of China, and he won congressional approval of the Formosa Resolution. His administration provided major aid to help the French fight off Vietnamese Communists in the First Indochina War. After the French left, he gave strong financial support to the new state of South Vietnam. He supported regime-changing military coups in Iran and Guatemala orchestrated by his own administration. During the Suez Crisis of 1956, he condemned the Israeli, British, and French invasion of Egypt, and he forced them to withdraw. He also condemned the Soviet invasion during the Hungarian Revolution of 1956 but took no action. He deployed 15,000 soldiers during the 1958 Lebanon crisis. Near the end of his term, a summit meeting with the Soviet leader Nikita Khrushchev was cancelled when a US spy plane was shot down over the Soviet Union. Eisenhower approved the Bay of Pigs Invasion, which was left to John F. Kennedy to carry out.\n</p><p>On the domestic front, Eisenhower governed as a moderate conservative who continued New Deal agencies and expanded Social Security. He covertly opposed Joseph McCarthy and contributed to the end of McCarthyism by openly invoking executive privilege. He signed the Civil Rights Act of 1957 and sent Army troops to enforce federal court orders which integrated schools in Little Rock, Arkansas. His administration undertook the development and construction of the Interstate Highway System, which remains the largest construction of roadways in American history. In 1957, following the Soviet launch of Sputnik, Eisenhower led the American response which included the creation of NASA and the establishment of a stronger, science-based education via the National Defense Education Act. The Soviet Union began to reinforce their own space program, escalating the Space Race. His two terms saw unprecedented economic prosperity except for a minor recession in 1958. In his farewell address, he expressed his concerns about the dangers of massive military spending, particularly deficit spending and government contracts to private military manufacturers, which he dubbed \"the military-industrial complex\". Historical evaluations of his presidency place him among the upper tier of American presidents.\n</p>"}
{"firstName":"John","lastName":"Kennedy","dob":"1917-05-29","dod":"1963-11-22","presidentNumber":35,"terms":1,"party":"Democratic","birthplace":{"city":"Brookline","state":"Massachusetts","latitude":42.3317,"longitude":-71.1212},"image":"john-kennedy.jpg","vicePresidents":[{"firstName":"Lyndon","lastName":"Johnson","dob":"1908-08-27","dod":"1973-01-22","presidentNumber":35,"terms":1,"party":"Democratic"}],"firstLadies":[{"firstName":"Jacqueline","lastName":"Kennedy Onassis","dob":"1929-07-28","dod":"1994-05-19"}],"description":"<p><b>John Fitzgerald Kennedy</b> (May 29, 1917 - November 22, 1963), often referred to as <b>JFK</b>, was an American politician who served as the 35th president of the United States from 1961 until his assassination in 1963. He was the youngest person elected president. Kennedy served at the height of the Cold War, and the majority of his foreign policy concerned relations with the Soviet Union and Cuba. A Democrat, Kennedy represented Massachusetts in both houses of the United States Congress prior to his presidency.\n</p><p>Born into the prominent Kennedy family in Brookline, Massachusetts, Kennedy graduated from Harvard University in 1940, joining the U.S. Naval Reserve the following year. During World War II, he commanded PT boats in the Pacific theater. Kennedy's survival following the sinking of PT-109 and his rescue of his fellow sailors made him a war hero and earned the Navy and Marine Corps Medal, but left him with serious injuries. After a brief stint in journalism, Kennedy represented a working-class Boston district in the U.S. House of Representatives from 1947 to 1953. He was subsequently elected to the U.S. Senate, serving as the junior senator for Massachusetts from 1953 to 1960. While in the Senate, Kennedy published his book, <i>Profiles in Courage</i>, which won a Pulitzer Prize. Kennedy ran in the 1960 presidential election. His campaign gained momentum after the first televised presidential debates in American history, and he was elected president, narrowly defeating Republican opponent Richard Nixon, the incumbent vice president.\n</p><p>Kennedy's presidency saw high tensions with communist states in the Cold War. He increased the number of American military advisers in South Vietnam, and the Strategic Hamlet Program began during his presidency. In 1961, he authorized attempts to overthrow the Cuban government of Fidel Castro in the failed Bay of Pigs Invasion and Operation Mongoose. In October 1962, U.S. spy planes discovered Soviet missile bases had been deployed in Cuba. The resulting period of tensions, termed the Cuban Missile Crisis, nearly resulted in nuclear war. In August 1961, after East German troops erected the Berlin Wall, Kennedy sent an army convoy to reassure West Berliners of U.S. support, and delivered one of his most famous speeches in West Berlin in June 1963. In 1963, Kennedy signed the first nuclear weapons treaty. He presided over the establishment of the Peace Corps, Alliance for Progress with Latin America, and the continuation of the Apollo program with the goal of landing a man on the Moon before 1970. He supported the civil rights movement but was only somewhat successful in passing his New Frontier domestic policies.\n</p><p>On November 22, 1963, Kennedy was assassinated in Dallas. His vice president, Lyndon B. Johnson, assumed the presidency. Lee Harvey Oswald was arrested for the assassination, but he was shot and killed by Jack Ruby two days later. The FBI and the Warren Commission both concluded Oswald had acted alone, but conspiracy theories about the assassination persist. After Kennedy's death, Congress enacted many of his proposals, including the Civil Rights Act of 1964 and the Revenue Act of 1964. Kennedy ranks highly in polls of U.S. presidents with historians and the general public. His personal life has been the focus of considerable sustained interest following public revelations in the 1970s of his chronic health ailments and extramarital affairs. Kennedy is the most recent U.S. president to have died in office.\n</p>"}
{"firstName":"Lyndon","lastName":"Johnson","dob":"1908-08-27","dod":"1973-01-22","presidentNumber":36,"terms":2,"party":"Democratic","birthplace":{"city":"Stonewall","state":"Texas","latitude":30.2376,"longitude":-98.6587},"image":"lyndon-johnson.jpg","vicePresidents":[{"firstName":"Hubert","lastName":"Humphrey","dob":"1911-05-27","dod":"1978-01-13","presidentNumber":36,"terms":1,"party":"Democratic"}],"firstLadies":[{"firstName":"Lady Bird","lastName":"Johnson","dob":"1912-12-22","dod":"2007-07-11"}],"description":"<p><b>Lyndon Baines Johnson</b> (August 27, 1908 - January 22, 1973), often referred to as <b>LBJ</b>, was an American politician who served as the 36th president of the United States from 1963 to 1969. He became president after the assassination of John F. Kennedy, under whom he had served as the 37th vice president from 1961 to 1963. A Democrat from Texas, Johnson also served as a U.S. representative and U.S. senator.\n</p><p>Born in Stonewall, Texas, Johnson worked as a teacher and a congressional aide before winning election to the U.S. House of Representatives in 1937. In 1948, he was controversially declared the winner in the Democratic Party's primary for the 1948 Senate election in Texas and won the general election. He became Senate majority whip in 1951, Senate Democratic leader in 1953 and majority leader in 1954. Senator Kennedy bested Johnson and his other rivals for the 1960 Democratic presidential nomination before surprising many by offering to make Johnson his vice presidential running mate. The Kennedy-Johnson ticket won the general election. Vice President Johnson assumed the presidency in 1963, after President Kennedy was assassinated. The following year, Johnson was elected to the presidency in a landslide, winning the largest share of the popular vote for the Democratic Party in history, and the highest for any candidate since the advent of widespread popular elections in the 1820s.\n</p><p>Johnson's Great Society was aimed at expanding civil rights, public broadcasting, access to health care, aid to education and the arts, urban and rural development, and public services. He sought to create better living conditions for low-income Americans by spearheading the war on poverty. As part of these efforts, Johnson signed the Social Security Amendments of 1965, which resulted in the creation of Medicare and Medicaid. Johnson made the Apollo program a national priority; enacted the Higher Education Act of 1965, which established federally insured student loans; and signed the Immigration and Nationality Act of 1965, which laid the groundwork for U.S. immigration policy today. Johnson's stance on civil rights put him at odds with other white, Southern Democrats. His civil rights legacy was shaped by the Civil Rights Act of 1964, the Voting Rights Act of 1965, and the Civil Rights Act of 1968. Due to his domestic agenda, Johnson's presidency marked the peak of modern American liberalism in the 20th century. Johnson's foreign policy prioritized containment of communism, including in the ongoing Vietnam War.\n</p><p>Johnson began his presidency with near-universal support, but his approval declined throughout his presidency as the public became frustrated with both the Vietnam War and domestic unrest, including race riots in major cities and increasing crime. Johnson initially sought to run for re-election; however, following disappointing results in the New Hampshire primary he withdrew his candidacy. Johnson retired to his Texas ranch and died in 1973. Public opinion and academic assessments of Johnson's legacy have fluctuated greatly. Historians and scholars rank Johnson in the upper tier for his accomplishments regarding domestic policy. His administration passed many major laws that made substantial changes in civil rights, health care, welfare, and education. Conversely, Johnson is heavily criticized for his foreign policy, namely escalating American involvement in the Vietnam War.\n</p>"}
{"firstName":"Richard","lastName":"Nixon","dob":"1913-01-09","dod":"1994-04-22","presidentNumber":37,"terms":2,"party":"Republican","birthplace":{"city":"Yorba Linda","state":"California","latitude":33.8886,"longitude":-117.8131},"image":"richard-nixon.jpg","vicePresidents":[{"firstName":"Spiro","lastName":"Agnew","dob":"1918-11-09","dod":"1996-09-17","presidentNumber":37,"terms":1,"party":"Republican"},{"firstName":"Gerald","lastName":"Ford","dob":"1913-07-14","dod":"2006-12-26","presidentNumber":37,"terms":1,"party":"Republican"}],"firstLadies":[{"firstName":"Pat","lastName":"Nixon","dob":"1912-03-16","dod":"1993-06-22"}],"description":"<p><b>Richard Milhous Nixon</b> (January 9, 1913 - April 22, 1994) was the 37th president of the United States, serving from 1969 to 1974. A member of the Republican Party, he previously served as a representative and senator from California and as the 36th vice president from 1953 to 1961 under President Dwight D. Eisenhower. His presidency saw the reduction of U.S. involvement in the Vietnam War, detente with the Soviet Union and China, the Apollo 11 Moon landing, and the establishment of the Environmental Protection Agency and Occupational Safety and Health Administration. Nixon's second term ended early when he became the only U.S. president to resign from office, as a result of the Watergate scandal.\n</p><p>Nixon was born into a poor family of Quakers in Yorba Linda, Southern California. He graduated from Duke Law School in 1937, practiced law in California, and then moved with his wife Pat to Washington, D.C., in 1942 to work for the federal government. After serving active duty in the Naval Reserve during World War II, he was elected to the House of Representatives in 1946. His work on the Alger Hiss case established his reputation as a leading anti-communist. In 1950, he was elected to the Senate. Nixon was the running mate of Eisenhower, the Republican Party's presidential nominee in the 1952 election, and served for eight years as vice president. He narrowly lost the 1960 presidential election to John F. Kennedy. After his loss in the 1962 race for governor of California, he announced his retirement from politics. However, in 1968, he made another run for the presidency and narrowly defeated the Democratic incumbent vice president Hubert Humphrey.\n</p><p>Seeking to bring the North Vietnamese to the negotiating table, Nixon ordered military operations and carpet bombing campaigns in Cambodia. He ended American combat involvement in Vietnam in 1973 and the military draft the same year. His visit to China in 1972 eventually led to diplomatic relations between the two nations, and he then concluded the Anti-Ballistic Missile Treaty with the Soviet Union. Domestically, Nixon pushed for the Controlled Substances Act and began the war on drugs. Nixon's first term took place at the height of the American environmental movement and enacted many progressive environmental policy shifts; his administration created the Environmental Protection Agency and passed legislation such as the Endangered Species Act and the Clean Air Acts. He implemented the ratified Twenty-sixth Amendment, which lowered the voting age from 21 to 18, and enforced the desegregation of Southern schools. Under Nixon, relations with Native Americans improved, seeing an increase in self-determination for Native Americans and his administration rescinded the termination policy. Nixon imposed wage and price controls for 90 days, began the war on cancer, and presided over the Apollo 11 Moon landing, which signaled the end of the Space Race. He was re-elected in 1972, when he defeated George McGovern in one of the largest landslide victories in American history.\n</p><p>In his second term, Nixon ordered an airlift to resupply Israeli losses in the Yom Kippur War, a conflict which led to the oil crisis at home. From 1973, ongoing revelations from the Nixon administration's involvement in Watergate eroded his support in Congress and the country. The scandal began with a break-in at the Democratic National Committee office, ordered by administration officials, and escalated despite cover-up efforts by the Nixon administration, of which he was aware. On August 9, 1974, facing almost certain impeachment and removal from office, Nixon resigned. Afterward, he was issued a controversial pardon by his successor, Gerald Ford. During nearly 20 years of retirement, Nixon wrote nine books and undertook many foreign trips, rehabilitating his image into that of an elder statesman and leading expert on foreign affairs. On April 18, 1994, he suffered a debilitating stroke, and died four days later. Rankings of his time in office have proven complex, with the successes of his presidency contrasted against the circumstances of both his ascension and his departure from office.\n</p>"}
{"firstName":"Gerald","lastName":"Ford","dob":"1913-07-14","dod":"2006-12-26","presidentNumber":38,"terms":1,"party":"Republican","birthplace":{"city":"Omaha","state":"Nebraska","latitude":41.2565,"longitude":-95.9345},"image":"gerald-ford.jpg","vicePresidents":[{"firstName":"Nelson","lastName":"Rockefeller","dob":"1908-07-08","dod":"1979-01-26","presidentNumber":38,"terms":1,"party":"Republican"}],"firstLadies":[{"firstName":"Betty","lastName":"Ford","dob":"1918-04-08","dod":"2011-07-08"}],"description":"<p><b>Gerald Rudolph Ford Jr.</b> (July 14, 1913 - December 26, 2006) was an American politician who served as the 38th president of the United States from 1974 to 1977. He previously served as the leader of the Republican Party in the U.S. House of Representatives from 1965 to 1973, and as the 40th vice president under President Richard Nixon from 1973 to 1974. Ford succeeded to the presidency when Nixon resigned in 1974, but was defeated for election to a full term in 1976. Ford is the only person to serve as president without winning an election for president or vice president.\n</p><p>Ford was born in Omaha, Nebraska and raised in Grand Rapids, Michigan. He attended the University of Michigan, where he played for the school's football team, before eventually attending Yale Law School. Afterward, he served in the U.S. Naval Reserve from 1942 to 1946. Ford began his political career in 1949 as the U.S. representative from Michigan's 5th congressional district, serving in this capacity for nearly 25 years, the final nine of them as the House minority leader. In December 1973, two months after Spiro Agnew's resignation, Ford became the first person appointed to the vice presidency under the terms of the 25th Amendment. After the subsequent resignation of Nixon in August 1974, Ford immediately assumed the presidency.\n</p><p>Domestically, Ford presided over the worst economy in the four decades since the Great Depression, with growing inflation and a recession. In one of his most controversial acts, he granted a presidential pardon to Nixon for his role in the Watergate scandal. Foreign policy was characterized in procedural terms by the increased role Congress began to play, and by the corresponding curb on the powers of the president. Ford signed the Helsinki Accords, which marked a move toward detente in the Cold War. With the collapse of South Vietnam nine months into his presidency, U.S. involvement in the Vietnam War essentially ended. In the 1976 Republican presidential primary, Ford defeated Ronald Reagan for the Republican nomination, but narrowly lost the presidential election to the Democratic challenger, Jimmy Carter.\n</p><p>Following his years as president, Ford remained active in the Republican Party, but his moderate views on various social issues increasingly put him at odds with conservative members of the party in the 1990s and early 2000s. He also set aside the enmity he had felt towards Carter following the 1976 election and the two former presidents developed a close friendship. After experiencing a series of health problems, he died in Rancho Mirage, California in 2006. Surveys of historians and political scientists have ranked Ford as a below-average president, though retrospective public polls on his time in office were more positive.\n</p>"}
{"firstName":"Jimmy","lastName":"Carter","dob":"1924-10-01","dod":"","presidentNumber":39,"terms":1,"party":"Democratic","birthplace":{"city":"Plains","state":"Georgia","latitude":32.0346,"longitude":-84.3927},"image":"jimmy-carter.jpg","vicePresidents":[{"firstName":"Walter","lastName":"Mondale","dob":"1928-01-05","dod":"2021-04-19","presidentNumber":39,"terms":1,"party":"Democratic"}],"firstLadies":[{"firstName":"Rosalynn","lastName":"Carter","dob":"1927-08-18","dod":""}],"description":"<p><b>James Earl Carter Jr.</b> (born October 1, 1924) is an American politician and humanitarian who served as the 39th president of the United States from 1977 to 1981. A member of the Democratic Party, he was the 76th governor of Georgia from 1971 to 1975, and a Georgia state senator from 1963 to 1967. At age 99, Carter is the oldest living former U.S. president and the longest-lived president in U.S. history. \n</p><p>Carter was born and raised in Plains, Georgia. He graduated from the U.S. Naval Academy in 1946 and joined the U.S. Navy's submarine service. Carter returned home after his military service and revived his family's peanut-growing business. Opposing racial segregation, Carter supported the growing civil rights movement, and became an activist within the Democratic Party. He served in the Georgia State Senate from 1963 to 1967 and then as governor of Georgia from 1971 to 1975. As a dark-horse candidate not well known outside Georgia, Carter won the Democratic nomination and narrowly defeated the incumbent Republican Party president Gerald Ford in the 1976 presidential election.\n</p><p>Carter pardoned all Vietnam War draft evaders on his second day in office. He created a national energy policy that included conservation, price control, and new technology. Carter successfully pursued the Camp David Accords, the Panama Canal Treaties, and the second round of Strategic Arms Limitation Talks. He also confronted stagflation. His administration established the U.S. Department of Energy and the Department of Education. The end of his presidency was marked by the Iran hostage crisis, an energy crisis, the Three Mile Island accident, the Nicaraguan Revolution, and the Soviet invasion of Afghanistan. In response to the invasion, Carter escalated the Cold War by ending detente, imposing a grain embargo against the Soviets, enunciating the Carter Doctrine, and leading the multinational boycott of the 1980 Summer Olympics in Moscow. He lost the 1980 presidential election in a landslide to Ronald Reagan, the Republican nominee.\n</p><p>After leaving the presidency, Carter established the Carter Center to promote and expand human rights; in 2002 he received a Nobel Peace Prize for his work related to it. He traveled extensively to conduct peace negotiations, monitor elections, and further the eradication of infectious diseases. Carter is a key figure in the nonprofit housing organization Habitat for Humanity. He has also written numerous books, ranging from political memoirs to poetry, while continuing to comment on global affairs, including two books on the Israeli-Palestinian conflict, in which Carter criticizes Israel's treatment of Palestinians as apartheid. Polls of historians and political scientists generally rank Carter as a below-average president, though scholars and the public more favorably view his post-presidency, the longest in U.S. history.\n</p>"}
{"firstName":"Ronald","lastName":"Reagan","dob":"1911-02-06","dod":"2004-06-05","presidentNumber":40,"terms":2,"party":"Republican","birthplace":{"city":"Tampico","state":"Illinois","latitude":41.6269,"longitude":-89.7686},"image":"ronald-reagan.jpg","vicePresidents":[{"firstName":"George","lastName":"Bush","dob":"1924-06-12","dod":"2018-11-30","presidentNumber":40,"terms":2,"party":"Republican"}],"firstLadies":[{"firstName":"Nancy","lastName":"Reagan","dob":"1921-07-06","dod":"2016-03-06"}],"description":"<p><b>Ronald Wilson Reagan</b> (February 6, 1911 - June 5, 2004) was an American politician and actor who served as the 40th president of the United States from 1981 to 1989. A member of the Republican Party, his presidency constituted the Reagan era, and he is considered one of the most prominent conservative figures in American history.\n</p><p>Raised in the small towns of northern Illinois, Reagan graduated from Eureka College in 1932 and worked as a sports broadcaster on several regional radio stations. He moved to California in 1937 and became a well-known film actor there. Reagan twice served as the president of the Screen Actors Guild from 1947 to 1952 and from 1959 to 1960. During the 1950s, he worked in television and spoke for General Electric. Reagan's \"A Time for Choosing\" speech during the 1964 presidential campaign elevated him as a new conservative figure. He was elected governor of California in 1966. During his governorship, he raised taxes, turned the state budget deficit into a surplus, and implemented harsh crackdowns on the Free Speech Movement. After challenging and losing to incumbent president Gerald Ford in the 1976 Republican presidential primaries, Reagan won the Republican nomination and then a landslide victory over incumbent Democratic president Jimmy Carter in the 1980 presidential election.\n</p><p>In his first term, Reagan implemented \"Reaganomics\", which involved economic deregulation and cuts in both taxes and government spending during a period of stagflation. He escalated an arms race and transitioned Cold War policy away from the policies of detente with the Soviet Union that had been established by Richard Nixon. Reagan also ordered the U.S. invasion of Grenada in 1983. Additionally, he survived an assassination attempt, fought public-sector labor unions, expanded the war on drugs, and was slow to respond to the AIDS epidemic in the United States, which began early in his presidency. In the 1984 presidential election, he defeated Carter's vice president Walter Mondale in another landslide victory. Foreign affairs dominated Reagan's second term, including the 1986 bombing of Libya, the Iran-Iraq War, the secret and illegal sale of arms to Iran to fund the Contras, and a more conciliatory approach in talks with Soviet leader Mikhail Gorbachev that culminated in the Intermediate-Range Nuclear Forces Treaty.\n</p><p>Reagan left the presidency in 1989 with the American economy having seen a significant reduction of inflation, the unemployment rate having fallen, and the United States having entered its then-longest peacetime expansion. At the same time, the national debt had nearly tripled since 1981 as a result of his cuts in taxes and increased military spending, despite cuts to domestic discretionary spending. Reagan's policies also contributed to the end of the Cold War and the end of Soviet communism. Alzheimer's disease hindered Reagan post-presidency, and his physical and mental capacities gradually deteriorated, ultimately leading to his death in 2004. Historians and scholars have typically ranked him above average among American presidents, and his post-presidential approval ratings by the general public are usually high.\n</p>"}
{"firstName":"George","lastName":"Bush","dob":"1924-06-12","dod":"2018-11-30","presidentNumber":41,"terms":1,"party":"Republican","birthplace":{"city":"Milton","state":"Massachusetts","latitude":42.2495,"longitude":-71.0662},"image":"george-h-bush.jpg","vicePresidents":[{"firstName":"Dan","lastName":"Quayle","dob":"1947-02-04","dod":"","presidentNumber":41,"terms":1,"party":"Republican"}],"firstLadies":[{"firstName":"Barbara","lastName":"Bush","dob":"1925-06-08","dod":"2018-04-17"}],"description":"<p><b>George Herbert Walker Bush</b> (June 12, 1924 - November 30, 2018) was an American politician, diplomat, and businessman who served as the 41st president of the United States from 1989 to 1993. A member of the Republican Party, he also served as the 43rd vice president from 1981 to 1989 under Ronald Reagan and previously in various other federal positions.\n</p><p>Born into a wealthy, established family in Milton, Massachusetts, Bush was raised in Greenwich, Connecticut. He attended Phillips Academy and served as a pilot in the United States Navy Reserve during World War II before graduating from Yale and moving to West Texas, where he established a successful oil company. Following an unsuccessful run for the United States Senate in 1964, he was elected to represent Texas's 7th congressional district in 1966. President Richard Nixon appointed Bush as the ambassador to the United Nations in 1971 and as chairman of the Republican National Committee in 1973. President Gerald Ford appointed him as the chief of the Liaison Office to the People's Republic of China in 1974 and as the director of Central Intelligence in 1976. Bush ran for president in 1980 but was defeated in the Republican presidential primaries by Reagan, who then selected Bush as his vice presidential running mate. In the 1988 presidential election, Bush defeated Democrat Michael Dukakis.\n</p><p>Foreign policy drove Bush's presidency as he navigated the final years of the Cold War and played a key role in the reunification of Germany. He presided over the invasion of Panama and the Gulf War, ending the Iraqi occupation of Kuwait in the latter conflict. Though the agreement was not ratified until after he left office, Bush negotiated and signed the North American Free Trade Agreement, which created a trade bloc consisting of the United States, Canada and Mexico. Domestically, Bush reneged on a 1988 campaign promise by enacting legislation to raise taxes to justify reducing the budget deficit. He championed and signed three pieces of bipartisan legislation in 1990, the Americans with Disabilities Act, the Immigration Act and the Clean Air Act Amendments. He also appointed David Souter and Clarence Thomas to the Supreme Court. Bush lost the 1992 presidential election to Democrat Bill Clinton following an economic recession, his turnaround on his tax promise, and the decreased emphasis of foreign policy in a post-Cold War political climate.\n</p><p>After leaving office in 1993, Bush was active in humanitarian activities, often working alongside Clinton. With the victory of his son, George W. Bush, in the 2000 presidential election, the two became the second father-son pair to serve as the nation's president, following John Adams and John Quincy Adams. Another son, Jeb Bush, unsuccessfully sought the Republican presidential nomination in the 2016 primaries. Historians generally rank Bush as an above-average president.\n</p>"}
{"firstName":"Bill","lastName":"Clinton","dob":"1946-08-19","dod":"","presidentNumber":42,"terms":2,"party":"Democratic","birthplace":{"city":"Hope","state":"Arkansas","latitude":33.6671,"longitude":-93.5916},"image":"bill-clinton.jpg","vicePresidents":[{"firstName":"Al","lastName":"Gore","dob":"1948-03-31","dod":"","presidentNumber":42,"terms":2,"party":"Democratic"}],"firstLadies":[{"firstName":"Hillary","lastName":"Clinton","dob":"1947-10-26","dod":""}],"description":"<p><b>William Jefferson Clinton</b> (born August 19, 1946) is an American lawyer and politician  who served as the 42nd president of the United States from 1993 to 2001. A member of the Democratic Party, he previously served as governor of Arkansas from 1979 to 1981 and again from 1983 to 1992. Clinton, whose policies reflected a centrist \"Third Way\" political philosophy, became known as a New Democrat.\n</p><p>Clinton was born and raised in Arkansas. He graduated from Georgetown University in 1968, and later from Yale Law School, where he met his future wife, Hillary Rodham. After graduating from law school, Clinton returned to Arkansas and won election as state attorney general, followed by two non-consecutive tenures as Arkansas governor. As governor, he overhauled the state's education system and served as chairman of the National Governors Association. Clinton was elected president in the 1992 election, defeating the incumbent Republican Party president George H. W. Bush and the independent businessman Ross Perot. He became the first president to be born in the Baby Boomer generation.\n</p><p>Clinton presided over the longest period of peacetime economic expansion in American history. He signed into law the North American Free Trade Agreement and the Violent Crime Control and Law Enforcement Act but failed to pass his plan for national health care reform. Starting in the mid-1990s, he began an ideological evolution as he became much more conservative in his domestic policy, advocating for and signing the Personal Responsibility and Work Opportunity Act, the State Children's Health Insurance Program and financial deregulation measures. He appointed Ruth Bader Ginsburg and Stephen Breyer to the U.S. Supreme Court. In foreign policy, Clinton ordered U.S. military intervention in the Bosnian and Kosovo wars, eventually signing the Dayton Peace agreement. He also called for the expansion of NATO in Eastern Europe and many former Warsaw Pact members joined NATO during his presidency. Clinton's foreign policy in the Middle East saw him sign the Iraq Liberation Act which gave aid to groups against Saddam Hussein. He also participated in the Oslo I Accord and Camp David Summit to advance the Israeli-Palestinian peace process, and assisted the Northern Ireland peace process.\n</p><p>Clinton won re-election in the 1996 election, defeating Republican nominee Bob Dole and Reform Party nominee Perot. His second term was dominated by the Clinton-Lewinsky scandal, which began in 1995, when he had a sexual relationship with the then 22-year-old White House intern Monica Lewinsky. In January 1998, news of the affair made tabloid headlines. This scandal escalated throughout the year, culminating in December when Clinton was impeached by the House of Representatives, becoming the first U.S. president to be impeached since Andrew Johnson. The two impeachment articles that the House passed were centered around perjury and Clinton using the powers of the presidency to commit obstruction of justice. In 1999, Clinton's impeachment trial began in the Senate, where he was acquitted on both charges. During the last three years of Clinton's presidency, the Congressional Budget Office reported a budget surplus -- the first such surplus since 1969.\n</p><p>Clinton left office in 2001 with the joint-highest approval rating of any U.S. president. His presidency ranks among the middle to upper tier in historical rankings of U.S. presidents. However, his personal conduct and misconduct allegations have made him the subject of substantial scrutiny. Since leaving office, Clinton has been involved in public speaking and humanitarian work. He created the Clinton Foundation to address international causes such as the prevention of HIV/AIDS and global warming. In 2009, he was named the United Nations special envoy to Haiti. After the 2010 Haiti earthquake, Clinton founded the Clinton Bush Haiti Fund with George W. Bush and Barack Obama. He has remained active in Democratic Party politics, campaigning for his wife's 2008 and 2016 presidential campaigns.\n</p>"}
{"firstName":"George","lastName":"Bush","dob":"1946-07-06","dod":"","presidentNumber":43,"terms":2,"party":"Republican","birthplace":{"city":"New Haven","state":"Connecticut","latitude":41.3083,"longitude":-72.9279},"image":"george-w-bush.jpg","vicePresidents":[{"firstName":"Dick","lastName":"Cheney","dob":"1941-01-30","dod":"","presidentNumber":43,"terms":2,"party":"Republican"}],"firstLadies":[{"firstName":"Laura","lastName":"Bush","dob":"1946-11-04","dod":""}],"description":"<p><b>George Walker Bush</b> (born July 6, 1946) is an American politician and businessman who served as the 43rd president of the United States from 2001 to 2009. A member of the Republican Party, he also served as the 46th governor of Texas from 1995 to 2000.\n</p><p>The eldest son of the 41st president, George H. W. Bush, and a member of the Bush family, he flew warplanes in the Texas Air National Guard in his twenties. After graduating from Harvard Business School in 1975, he worked in the oil industry. He later co-owned the Texas Rangers, of Major League Baseball, before being elected governor of Texas in 1994. As governor, Bush successfully sponsored legislation for tort reform, increased education funding, set higher standards for schools, and reformed the criminal justice system. He also helped make Texas the country's leading producer of wind-generated electricity. In the 2000 presidential election, he won over Democratic incumbent Vice President Al Gore, while losing the popular vote after a narrow and contested Electoral College win, which involved a Supreme Court decision to stop a recount in Florida.\n</p><p>In office, Bush signed a major tax-cut program and an education-reform bill, the No Child Left Behind Act. He pushed for socially conservative efforts such as the Partial-Birth Abortion Ban Act and faith-based initiatives. He also initiated the President's Emergency Plan for AIDS Relief, in 2003, to address the AIDS epidemic. The terrorist attacks on September 11, 2001 decisively reshaped his administration, resulting in the start of the war on terror and the creation of the Department of Homeland Security. Bush ordered the 2001 invasion of Afghanistan in an effort to overthrow the Taliban, destroy al-Qaeda, and capture Osama bin Laden. He signed the Patriot Act to authorize surveillance of suspected terrorists. He also ordered the 2003 invasion of Iraq, on the inaccurate belief that Saddam Hussein's regime possessed weapons of mass destruction and had ties with al-Qaeda. Bush later signed the Medicare Modernization Act, which created Medicare Part D. In 2004, Bush was re-elected president in a close race, beating Democratic opponent John Kerry and winning the popular vote.\n</p><p>During his second term, Bush made free trade agreements. He appointed John Roberts and Samuel Alito to the Supreme Court. He sought major changes to Social Security and immigration laws, but both efforts failed in Congress. Bush was widely criticized for his handling of Hurricane Katrina and the midterm dismissal of U.S. attorneys. Amid his unpopularity, the Democrats regained control of Congress in the 2006 elections. The Afghanistan and Iraq wars continued; in January 2007, Bush launched a surge of troops in Iraq. By December, the U.S. entered the Great Recession, prompting the Bush administration to get congressional approval for economic programs intended to preserve the country's financial system, including the Troubled Asset Relief Program.\n</p><p>\nAfter his second term, Bush returned to Texas, where he has maintained a low public profile. At various points in his presidency, he was among both the most popular and the most unpopular presidents in U.S. history. He received the highest recorded approval ratings in the wake of the September 11 attacks, and one of the lowest ratings during the 2007–2008 financial crisis. Although Bush's presidency has generally been rated as below average by scholars, public opinion of him has improved greatly since he left office.</p>"}
{"firstName":"Barack","lastName":"Obama","dob":"1961-08-04","dod":"","presidentNumber":44,"terms":2,"party":"Democratic","birthplace":{"city":"Honolulu","state":"Hawaii","latitude":21.3069,"longitude":-157.8583},"image":"barack-obama.jpg","vicePresidents":[{"firstName":"Joe","lastName":"Biden","dob":"1942-11-20","dod":"","presidentNumber":44,"terms":2,"party":"Democratic"}],"firstLadies":[{"firstName":"Michelle","lastName":"Obama","dob":"1964-01-17","dod":""}],"description":"Barack Hussein Obama II is an American politician and attorney who served as the 44th president of the United States from 2009 to 2017. A member of the Democratic Party, Obama was the first African-American president of the United States."}
{"firstName":"Donald","lastName":"Trump","dob":"1946-06-14","dod":"","presidentNumber":45,"terms":1,"party":"Republican","birthplace":{"city":"Queens","state":"New York","latitude":40.7282,"longitude":-73.7949},"image":"donald-trump.jpg","vicePresidents":[{"firstName":"Mike","lastName":"Pence","dob":"1959-06-07","dod":"","presidentNumber":45,"terms":1,"party":"Republican"}],"firstLadies":[{"firstName":"Melania","lastName":"Trump","dob":"1970-04-26","dod":""}],"description":"<p>Donald John Trump (born June 14, 1946) is an American politician, media personality, and businessman who served as the 45th president of the United States from 2017 to 2021.</p><p>Trump received a Bachelor of Science degree in economics from the University of Pennsylvania in 1968. His father made him president of the family real estate business in 1971. Trump renamed it the Trump Organization and reoriented the company toward building and renovating skyscrapers, hotels, casinos, and golf courses. After a series of business failures in the late 1990s, he launched side ventures, mostly licensing the Trump name. From 2004 to 2015, he co-produced and hosted the reality television series <i>The Apprentice</i>. He and his businesses have been plaintiffs or defendants in more than 4,000 legal actions, including six business bankruptcies.</p><p>Trump won the 2016 presidential election as the Republican Party nominee against Democratic Party candidate Hillary Clinton while losing the popular vote. The Mueller special counsel investigation determined that Russia interfered in the 2016 election to favor Trump.  During the campaign, his political positions were described as populist, protectionist, and nationalist. His election and policies sparked numerous protests. He was the only U.S. president without prior military or government experience. Trump promoted conspiracy theories and made many false and misleading statements during his campaigns and presidency, to a degree unprecedented in American politics. Many of his comments and actions have been characterized as racially charged, racist, and misogynistic.</p><p>As president, Trump ordered a travel ban on citizens from several Muslim-majority countries, diverted military funding toward building a wall on the U.S.-Mexico border, and implemented a family separation policy. He rolled back more than 100 environmental policies and regulations. He signed the Tax Cuts and Jobs Act of 2017, which cut taxes and eliminated the individual health insurance mandate penalty of the Affordable Care Act. He appointed Neil Gorsuch, Brett Kavanaugh, and Amy Coney Barrett to the U.S. Supreme Court. He reacted slowly to the COVID-19 pandemic, ignored or contradicted many recommendations from health officials, used political pressure to interfere with testing efforts, and spread misinformation about unproven treatments. Trump initiated a trade war with China and withdrew the U.S. from the proposed Trans-Pacific Partnership trade agreement, the Paris Agreement on climate change, and the Iran nuclear deal. He met with North Korean leader Kim Jong Un three times but made no progress on denuclearization.</p><p>Trump is the only U.S. president to have been impeached twice, in 2019 for abuse of power and obstruction of Congress after he pressured Ukraine to investigate Joe Biden, and in 2021 for incitement of insurrection. The Senate acquitted him in both cases. Trump lost the 2020 presidential election to Biden but refused to concede. He falsely claimed widespread electoral fraud and attempted to overturn the results. On January 6, 2021, he urged his supporters to march to the U.S. Capitol, which many of them attacked. Scholars and historians rank Trump as one of the worst presidents in American history.</p><p>Since leaving office, Trump has continued to dominate the Republican Party and is their nominee again in the 2024 presidential election. In May 2024, a jury in New York found Trump guilty on 34 felony counts of falsifying business records related to a hush money payment to Stormy Daniels in an attempt to influence the 2016 election, making him the first former U.S. president to be convicted of a crime. He has been indicted in three other jurisdictions on 54 other felony counts related to his mishandling of classified documents and for efforts to overturn the 2020 presidential election. In civil proceedings, Trump was found liable for sexual abuse and defamation in 2023, defamation in 2024, and financial fraud in 2024."}
{"firstName":"Joe","lastName":"Biden","dob":"1942-11-20","dod":"","presidentNumber":46,"terms":1,"party":"Democratic","birthplace":{"city":"Scranton","state":"Pennsylvania","latitude":41.4089,"longitude":-75.6624},"image":"joe-biden.jpg","vicePresidents":[{"firstName":"Kamala","lastName":"Harris","dob":"1964-10-20","dod":"","presidentNumber":46,"terms":1,"party":"Democratic"}],"firstLadies":[{"firstName":"Jill","lastName":"Biden","dob":"1951-06-03","dod":""}],"description":"<p>Joseph Robinette Biden Jr. (born November 20, 1942) is an American politician who has been the 46th and current president of the United States since 2021. A member of the Democratic Party, he served as the 47th vice president from 2009 to 2017 under President Barack Obama and represented Delaware in the U.S. Senate from 1973 to 2009.</p><p>Born in Scranton, Pennsylvania, Biden moved with his family to Delaware in 1953. He graduated from the University of Delaware in 1965 and from Syracuse University in 1968. He was elected to the New Castle County Council in 1970 and the U.S. Senate in 1972. As a senator, Biden drafted and led the effort to pass the Violent Crime Control and Law Enforcement Act and the Violence Against Women Act. He also oversaw six U.S. Supreme Court confirmation hearings, including the contentious hearings for Robert Bork and Clarence Thomas. Biden ran unsuccessfully for the 1988 and 2008 Democratic presidential nominations. In 2008, Obama chose Biden as his running mate, and he was a close counselor to Obama during his two terms as vice president. In the 2020 presidential election, the Democratic Party nominated Biden for president. He selected Kamala Harris as his running mate, and they defeated Republican incumbents Donald Trump and Mike Pence. He is the oldest president in U.S. history and the first to serve with a female vice president. </p><p>As president, Biden signed the American Rescue Plan Act in response to the COVID-19 pandemic and subsequent recession. He signed bipartisan bills on infrastructure and manufacturing. He proposed the Build Back Better Act, which failed in Congress, but aspects of which were incorporated into the Inflation Reduction Act that he signed into law in 2022. Biden appointed Ketanji Brown Jackson to the Supreme Court. He worked with congressional Republicans to resolve the 2023 debt-ceiling crisis by negotiating a deal to raise the debt ceiling. In foreign policy, Biden restored America's membership in the Paris Agreement. He oversaw the complete withdrawal of U.S. troops from Afghanistan that ended the war in Afghanistan, leading to the collapse of the Afghan government and the Taliban seizing control. He responded to the Russian invasion of Ukraine by imposing sanctions on Russia and authorizing civilian and military aid to Ukraine. During the Israel-Hamas war, Biden condemned the actions of Hamas as terrorism, announced military support for Israel and sent limited humanitarian aid to the Gaza Strip.</p><p>In April 2023, Biden announced his reelection campaign and, after the Democratic primaries, became the Democratic Party's presumptive nominee in the 2024 presidential election. However, he withdrew his candidacy in July 2024 after concerns about his age and health, becoming the first U.S. president to withdraw after securing enough delegates to win renomination. He endorsed Vice President Harris to be the Democrats' nominee instead."}
